{"id": 1203718436410540036, "date": "2019-12-09", "time": "00:50:13", "tweet": "....Biden on the board of the largest natural gas company in Ukraine, getting paid $83,000 a month, 10 times as much as a board member of @exxonmobil.” Thank you Ted. He also  made a fortune from China and others, but zero before his father became V.P. @MeetThePress"}
{"id": 1203695094949457920, "date": "2019-12-08", "time": "23:17:28", "tweet": "....with the U.S. Presidential Election in November. North Korea, under the leadership of Kim Jong Un, has tremendous economic potential, but it must denuclearize as promised. NATO, China, Russia, Japan, and the entire world is unified on this issue!"}
{"id": 1203109065070665728, "date": "2019-12-07", "time": "08:28:48", "tweet": "Why is the World Bank loaning money to China? Can this be possible? China has plenty of money, and if they don’t, they create it. STOP!"}
{"id": 1201458758934781953, "date": "2019-12-02", "time": "19:11:04", "tweet": "U.S. Markets are up as much as 21% since the announcement of Tariffs on 3/1/2018 - and the U.S. is taking in massive amounts of money (and giving some to our farmers, who have been targeted by China)!"}
{"id": 1196458467982270464, "date": "2019-11-19", "time": "00:01:42", "tweet": "Just finished a very good & cordial meeting at the White House with Jay Powell of the Federal Reserve. Everything was discussed including interest rates, negative interest, low inflation, easing, Dollar strength & its effect on manufacturing, trade with China, E.U. & others, etc."}
{"id": 1196097712925691906, "date": "2019-11-18", "time": "00:08:11", "tweet": "Our great Farmers will recieve another major round of “cash,” compliments of China Tariffs, prior to Thanksgiving. The smaller farms and farmers will be big beneficiaries. In the meantime, and as you may have noticed, China is starting to buy big again. Japan deal DONE. Enjoy!"}
{"id": 1194214569591394304, "date": "2019-11-12", "time": "19:25:15", "tweet": "....Ukrainian energy company, and more millions taken from China, and now reports of other companies and countries also giving him big money, are certainly looking very corrupt (to put it mildly!) to me. Both Bidens should be forced to testify in this No Due Process Scam!"}
{"id": 1189914359310553088, "date": "2019-10-31", "time": "22:37:45", "tweet": "....our manufacturers. We should have lower interest rates than Germany, Japan and all others. We are now, by far, the biggest and strongest Country, but the Fed puts us at a competitive disadvantage. China is not our problem, the Federal Reserve is! We will win anyway."}
{"id": 1189895935721197570, "date": "2019-10-31", "time": "21:24:32", "tweet": "China and the USA are working on selecting a new site for signing of Phase One of Trade Agreement, about 60% of total deal, after APEC in Chile was canceled do to unrelated circumstances. The new location will be announced soon. President Xi and President Trump will do signing!"}
{"id": 1183900672892309505, "date": "2019-10-15", "time": "08:21:30", "tweet": "A big scandal at @ABC News. They got caught using really gruesome FAKE footage of the Turks bombing in Syria. A real disgrace. Tomorrow they will ask softball questions to Sleepy Joe Biden’s son, Hunter, like why did Ukraine & China pay you millions when you knew nothing? Payoff?"}
{"id": 1183822494031065088, "date": "2019-10-15", "time": "03:10:51", "tweet": "....and Assad to protect the land of our enemy? Anyone who wants to assist Syria in protecting the Kurds is good with me, whether it is Russia, China, or Napoleon Bonaparte. I hope they all do great, we are 7,000 miles away!"}
{"id": 1183500215241859073, "date": "2019-10-14", "time": "05:50:14", "tweet": "CHINA HAS ALREADY BEGUN AGRICULTURAL PURCHASES FROM OUR GREAT PATRIOT FARMERS & RANCHERS!"}
{"id": 1183499482790612993, "date": "2019-10-14", "time": "05:47:19", "tweet": "....I agreed not to increase Tariffs from 25% to 30% on October 15th. They will remain at 25%. The relationship with China is very good. We will finish out the large Phase One part of the deal, then head directly into Phase Two. The Phase One Deal can be finalized & signed soon!"}
{"id": 1183499482069159941, "date": "2019-10-14", "time": "05:47:19", "tweet": "My deal with China is that they will IMMEDIATELY start buying very large quantities of our Agricultural Product, not wait until the deal is signed over the next 3 or 4 weeks. THEY HAVE ALREADY STARTED! Likewise financial services and other deal aspects, start preparing...."}
{"id": 1183021805570801665, "date": "2019-10-12", "time": "22:09:12", "tweet": "The deal I just made with China is, by far, the greatest and biggest deal ever made for our Great Patriot Farmers in the history of our Country. In fact, there is a question as to whether or not this much product can be produced? Our farmers will figure it out. Thank you China!"}
{"id": 1182859828386885633, "date": "2019-10-12", "time": "11:25:34", "tweet": "So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked, and looks weak and pathetic. Don’t want him at the White House!"}
{"id": 1182661081849835520, "date": "2019-10-11", "time": "22:15:49", "tweet": "One of the great things about the China Deal is the fact that, for various reasons, we do not have to go through the very long and politically complex Congressional Approval Process. When the deal is fully negotiated, I sign it myself on behalf of our Country. Fast and Clean!"}
{"id": 1182654371714211840, "date": "2019-10-11", "time": "21:49:09", "tweet": "Good things are happening at China Trade Talk Meeting. Warmer feelings than in recent past, more like the Old Days. I will be meeting with the Vice Premier today. All would like to see something significant happen!"}
{"id": 1182292163721404416, "date": "2019-10-10", "time": "21:49:52", "tweet": "Big day of negotiations with China. They want to make a deal, but do I? I meet with the Vice Premier tomorrow at The White House."}
{"id": 1181227885841002496, "date": "2019-10-07", "time": "23:20:48", "tweet": "I was elected on getting out of these ridiculous endless wars, where our great Military functions as a policing operation to the benefit of people who don’t even like the USA. The two most unhappy countries at this move are Russia & China, because they love seeing us bogged....."}
{"id": 1180994860188360704, "date": "2019-10-07", "time": "07:54:51", "tweet": ".@60Minutes “forgot” to report that we are helping the great farmers of the USA to the tune of 28 Billion Dollars, for the last two years, paid for out of Tariffs paid to the United States by China for targeting the farmer. They devalued their currency, therefore paying the cost!"}
{"id": 1180886040791388161, "date": "2019-10-07", "time": "00:42:26", "tweet": "....And by the way, I would LOVE running against 1% Joe Biden - I just don’t think it’s going to happen. Sleepy Joe won’t get to the starting gate, & based on all of the money he & his family probably “extorted,” Joe should hang it up. I wouldn’t want him dealing with China & U!"}
{"id": 1180859894003572736, "date": "2019-10-06", "time": "22:58:32", "tweet": "....and separately got 1.5 Billion Dollars from China despite no experience and for no apparent reason. There is NO WAY these can be legitimate transactions? As lawyers & others have stated, as President, I have an OBLIGATION to look into possible, or probable, CORRUPTION!"}
{"id": 1180484483147059200, "date": "2019-10-05", "time": "22:06:47", "tweet": "Somebody please wake up Mitt Romney and tell him that my conversation with the Ukrainian President was a congenial and very appropriate one, and my statement on China pertained to corruption, not politics. If Mitt worked this hard on Obama, he could have won. Sadly, he choked!"}
{"id": 1178986524630802432, "date": "2019-10-01", "time": "18:54:26", "tweet": "Congratulations to President Xi and the Chinese people on the 70th Anniversary of the People’s Republic of China!"}
{"id": 1178671715624394757, "date": "2019-09-30", "time": "22:03:30", "tweet": "The Fake News Media wants to stay as far away as possible from the Ukraine and China deals made by the Bidens. A Corrupt Media is so bad for our Country! In actuality, the Media may be even more Corrupt than the Bidens, which is hard to do!"}
{"id": 1178648671996526592, "date": "2019-09-30", "time": "20:31:56", "tweet": "....place in TRADE, it’s taking shape in Military Competition.” Johnathan Ward, author and China expert. We are winning, and we will win. They should not have broken the deal we had with them. Happy Birthday China!"}
{"id": 1178637628662538245, "date": "2019-09-30", "time": "19:48:03", "tweet": "“China Trade Turmoil: China Urging a CALM AND RATIONAL Solution.” @MariaBartiromo @FoxBusiness China is doing very poorly while the USA, under your favorite President’s leadership, continues to soar to new heights - and, despite the Do Nothing Democrats, we have just begun!"}
{"id": 1177357844062097409, "date": "2019-09-27", "time": "07:02:38", "tweet": "The President of Ukraine said that he was NOT pressured by me to do anything wrong. Can’t have better testimony than that! As V.P., Biden had his son, on the other hand, take out millions of dollars by strong arming the Ukrainian President. Also looted millions from China. Bad!"}
{"id": 1176953905776910341, "date": "2019-09-26", "time": "04:17:32", "tweet": "....taken out of Ukraine and China. Additionally, I demand transparency from Democrats that went to Ukraine and attempted to force the new President to do things that they wanted under the form of political threat."}
{"id": 1175766528743968769, "date": "2019-09-22", "time": "21:39:19", "tweet": "“The real story involves Hunter Biden going around the world and collecting large payments from foreign governments and foreign oligarchs.” Peter Schweizer  Laura Ingraham Hunter made a fortune in Ukraine and in China. He knew nothing about Energy, or anything else."}
{"id": 1173564171847385089, "date": "2019-09-16", "time": "19:47:56", "tweet": "Producer prices in China shrank most in 3 years due to China’s big devaluation of their currency, coupled with monetary stimulus. Federal Reserve not watching? Will Fed ever get into the game? Dollar strongest EVER! Really bad for exports. No Inflation...Highest Interest Rates..."}
{"id": 1172129122979581952, "date": "2019-09-12", "time": "20:45:34", "tweet": "It is expected that China will be buying large amounts of our agricultural products!"}
{"id": 1171925716503584773, "date": "2019-09-12", "time": "07:17:18", "tweet": "At the request of the Vice Premier of China, Liu He, and due to the fact that the People's Republic of China will be celebrating their 70th Anniversary...."}
{"id": 1171728799408500737, "date": "2019-09-11", "time": "18:14:50", "tweet": "“China suspends Tariffs on some U.S. products. Being hit very hard, supply chains breaking up as many companies move, or look to move, to other countries. Much more expensive to China than originally thought.” @CNBC @JoeSquawk"}
{"id": 1170171081853931520, "date": "2019-09-07", "time": "11:05:01", "tweet": "China just enacted a major stimulus plan. With all the Tariffs THEY are paying to the USA, Billions and Billions of Dollars, they need it! In the meantime, our Federal Reserve sits back and does NOTHING!"}
{"id": 1169992234382610432, "date": "2019-09-06", "time": "23:14:20", "tweet": "“China is eating the Tariffs.” Billions pouring into USA. Targeted Patriot Farmers getting massive Dollars from the incoming Tariffs! Good Jobs Numbers, No Inflation(Fed). China having worst year in decades. Talks happening, good for all!"}
{"id": 1169356703126773762, "date": "2019-09-05", "time": "05:08:58", "tweet": "1. Which country has the largest carbon emission reduction?  AMERICA!  2. Who has dumped the most carbon into the air?     CHINA!  3. 91% of the world’s population are exposed to air pollution above the World Health Organization’s suggested level.     NONE ARE IN THE U.S.A.!"}
{"id": 1169253299981303810, "date": "2019-09-04", "time": "22:18:05", "tweet": "....Trump is doing to China is not lost on the rest of the world. Europe has had among the most protectionist policies forever. They’re sitting there and saying, gee, are we next? Maybe you are! We’ve got to change the rules. The U.S. can’t defend the world and pay for it...."}
{"id": 1169253298169438208, "date": "2019-09-04", "time": "22:18:04", "tweet": "“The Chinese are very adept at not accepting anything. You’ve got to be very tough, and that’s what Trump is doing. It’s in China’s interest to correct, and I think we’ll end up with a solution that’s dramatically better than we have today. Frankly, I think the impact of what..."}
{"id": 1169246982508072960, "date": "2019-09-04", "time": "21:52:58", "tweet": "“U.S. Winning Trade War With China In Dollars.” CNBC"}
{"id": 1168879633984643072, "date": "2019-09-03", "time": "21:33:16", "tweet": "For all of the “geniuses” out there, many who have been in other administrations and “taken to the cleaners” by China, that want me to get together with the EU and others to go after China Trade practices remember, the EU & all treat us VERY unfairly on Trade also. Will change!"}
{"id": 1168874292626501633, "date": "2019-09-03", "time": "21:12:02", "tweet": "....And then, think what happens to China when I win. Deal would get MUCH TOUGHER! In the meantime, China’s Supply Chain will crumble and businesses, jobs and money will be gone!"}
{"id": 1168874291376656384, "date": "2019-09-03", "time": "21:12:02", "tweet": "We are doing very well in our negotiations with China. While I am sure they would love to be dealing with a new administration so they could continue their practice of “ripoff USA”($600 B/year),16 months PLUS is a long time to be hemorrhaging jobs and companies on a long-shot...."}
{"id": 1168137799712854016, "date": "2019-09-01", "time": "20:25:29", "tweet": "....is about American Freedom. Redirect the supply chain. There is no reason to buy everything from China!"}
{"id": 1168137797280174080, "date": "2019-09-01", "time": "20:25:28", "tweet": "Peter Morici, Economist: Tariffs will not impact American consumers that much because the Chinese currency has gone down, which gives our importers a discount. Importers can find suppliers outside of China. Absolutely worth it, we don’t want to be servants to the Chinese! This..."}
{"id": 1167867052410802178, "date": "2019-09-01", "time": "02:29:37", "tweet": "Just watched Congresswoman Debbie Dingell, and many other Democrats, wanting to give up on our very successful Trade battle with China, which has had its worst Economic year in memory (and getting worse). We are taking in $Billions. Will be big for Farmers and ALL!"}
{"id": 1167408293062594560, "date": "2019-08-30", "time": "20:06:41", "tweet": "General Motors, which was once the Giant of Detroit, is now one of the smallest auto manufacturers there. They moved major plants to China, BEFORE I CAME INTO OFFICE. This was done despite the saving help given them by the USA. Now they should start moving back to America again?"}
{"id": 1166683442098163712, "date": "2019-08-28", "time": "20:06:23", "tweet": "So interesting to read and see all of the free and interesting advice I am getting on China, from people who have tried to handle it before and failed miserably - In fact, they got taken to the cleaners. We are doing very well with China. This has never happened to them before!"}
{"id": 1165763483322834944, "date": "2019-08-26", "time": "07:10:47", "tweet": "In France we are all laughing at how knowingly inaccurate the U.S. reporting of events and conversations at the G-7 is. These Leaders, and many others, are getting a major case study of Fake News at it’s finest! They’ve got it all wrong, from Iran, to China Tariffs, to Boris!"}
{"id": 1165277725541765120, "date": "2019-08-24", "time": "23:00:34", "tweet": "When I looked up to the sky and jokingly said “I am the chosen one,” at a press conference two days ago, referring to taking on Trade with China, little did I realize that the media would claim that I had a “Messiah complex.” They knew I was kidding, being sarcastic, and just...."}
{"id": 1165111122510237696, "date": "2019-08-24", "time": "11:58:32", "tweet": "For all of the Fake News Reporters that don’t have a clue as to what the law is relative to Presidential powers, China, etc., try looking at the Emergency Economic Powers Act of 1977. Case closed!"}
{"id": 1165005930733473793, "date": "2019-08-24", "time": "05:00:33", "tweet": "...Additionally, the remaining 300 BILLION DOLLARS of goods and products from China, that was being taxed from September 1st at 10%, will now be taxed at 15%. Thank you for your attention to this matter!"}
{"id": 1165005929831702529, "date": "2019-08-24", "time": "05:00:33", "tweet": "...unfair Trading Relationship. China should not have put new Tariffs on 75 BILLION DOLLARS of United States product (politically motivated!). Starting on October 1st, the 250 BILLION DOLLARS of goods and products from China, currently being taxed at 25%, will be taxed at 30%..."}
{"id": 1165005928996986881, "date": "2019-08-24", "time": "05:00:32", "tweet": "....Sadly, past Administrations have allowed China to get so far ahead of Fair and Balanced Trade that it has become a great burden to the American Taxpayer. As President, I can no longer allow this to happen! In the spirit of achieving Fair Trade, we must Balance this very...."}
{"id": 1165005927864512512, "date": "2019-08-24", "time": "05:00:32", "tweet": "For many years China (and many other countries) has been taking advantage of the United States on Trade, Intellectual Property Theft, and much more. Our Country has been losing HUNDREDS OF BILLIONS OF DOLLARS a year to China, with no end in sight...."}
{"id": 1164914963766546435, "date": "2019-08-23", "time": "22:59:05", "tweet": "....all deliveries of Fentanyl from China (or anywhere else!). Fentanyl kills 100,000 Americans a year. President Xi said this would stop - it didn’t. Our Economy, because of our gains in the last 2 1/2 years, is MUCH larger than that of China. We will keep it that way!"}
{"id": 1164914962529247232, "date": "2019-08-23", "time": "22:59:04", "tweet": "....your companies HOME and making your products in the USA. I will be responding to China’s Tariffs this afternoon. This is a GREAT opportunity for the United States. Also, I am ordering all carriers, including Fed Ex, Amazon, UPS and the Post Office, to SEARCH FOR & REFUSE,...."}
{"id": 1164914960046133249, "date": "2019-08-23", "time": "22:59:04", "tweet": "....better off without them. The vast amounts of money made and stolen by China from the United States, year after year, for decades, will and must STOP. Our great American companies are hereby ordered to immediately start looking for an alternative to China, including bringing.."}
{"id": 1164914959131848705, "date": "2019-08-23", "time": "22:59:03", "tweet": "Our Country has lost, stupidly, Trillions of Dollars with China over many years. They have stolen our Intellectual Property at a rate of Hundreds of Billions of Dollars a year, & they want to continue. I won’t let that happen! We don’t need China and, frankly, would be far...."}
{"id": 1164158321265451008, "date": "2019-08-21", "time": "20:52:27", "tweet": "Doing great with China and other Trade Deals. The only problem we have is Jay Powell and the Fed. He’s like a golfer who can’t putt, has no touch. Big U.S. growth if he does the right thing, BIG CUT - but don’t count on him! So far he has called it wrong, and only let us down...."}
{"id": 1163169730477395968, "date": "2019-08-19", "time": "03:24:09", "tweet": "Our economy is the best in the world, by far. Lowest unemployment ever within almost all categories. Poised for big growth after trade deals are completed. Import prices down, China eating Tariffs. Helping targeted Farmers from big Tariff money coming in. Great future for USA!"}
{"id": 1163155586797723648, "date": "2019-08-19", "time": "02:27:56", "tweet": "We are doing very well with China, and talking!"}
{"id": 1162095183082729475, "date": "2019-08-16", "time": "04:14:16", "tweet": "“If they don’t get this Trade Deal with the U.S. done, China could have it first recession (or worse!) in years. There’s disinvestment in China right now. Also, the Fed is too tight (I agree).” Steve Moore, Heritage Foundation"}
{"id": 1162083867697852416, "date": "2019-08-16", "time": "03:29:19", "tweet": "Biden doesn’t have a clue! I will solve the China problem.  https://twitter.com/kimguilfoyle/status/1161681065104347136 …"}
{"id": 1162044502292537344, "date": "2019-08-16", "time": "00:52:53", "tweet": "The Fake News Media is doing everything they can to crash the economy because they think that will be bad for me and my re-election. The problem they have is that the economy is way too strong and we will soon be winning big on Trade, and everyone knows that, including China!"}
{"id": 1161774305895694336, "date": "2019-08-15", "time": "06:59:13", "tweet": "I know President Xi of China very well. He is a great leader who very much has the respect of his people. He is also a good man in a “tough business.” I have ZERO doubt that if President Xi wants to quickly and humanely solve the Hong Kong problem, he can do it. Personal meeting?"}
{"id": 1161767691646115840, "date": "2019-08-15", "time": "06:32:56", "tweet": "..deferral to December. It actually helps China more than us, but will be reciprocated. Millions of jobs are being lost in China to other non-Tariffed countries. Thousands of companies are leaving. Of course China wants to make a deal. Let them work humanely with Hong Kong first!"}
{"id": 1161767689762889728, "date": "2019-08-15", "time": "06:32:56", "tweet": "Good things were stated on the call with China the other day. They are eating the Tariffs with the devaluation of their currency and “pouring” money into their system. The American consumer is fine with or without the September date, but much good will come from the short....."}
{"id": 1161719408202584064, "date": "2019-08-15", "time": "03:21:05", "tweet": "We are winning, big time, against China. Companies & jobs are fleeing. Prices to us have not gone up, and in some cases, have come down. China is not our problem, though Hong Kong is not helping. Our problem is with the Fed. Raised too much & too fast. Now too slow to cut...."}
{"id": 1161278978201661440, "date": "2019-08-13", "time": "22:10:58", "tweet": "As usual, China said they were going to be buying “big” from our great American Farmers. So far they have not done what they said. Maybe this will be different!"}
{"id": 1161258370478858240, "date": "2019-08-13", "time": "20:49:05", "tweet": "Through massive devaluation of their currency and pumping vast sums of money into their system, the tens of billions of dollars that the U.S. is receiving is a gift from China. Prices not up, no inflation. Farmers getting more than China would be spending. Fake News won’t report!"}
{"id": 1160309383701680129, "date": "2019-08-11", "time": "05:58:09", "tweet": "China wants to make a deal so badly. Thousands of companies are leaving because of the Tariffs, they must stem the flow. At the same time China may be hoping for a Democrat to win so they could continue the great ripoff of America, & the theft of hundreds of Billions of $’s!"}
{"id": 1159177811573166081, "date": "2019-08-08", "time": "03:01:41", "tweet": "Watching Sleepy Joe Biden making a speech. Sooo Boring! The LameStream Media will die in the ratings and clicks with this guy. It will be over for them, not to mention the fact that our Country will do poorly with him. It will be one big crash, but at least China will be happy!"}
{"id": 1159083361803149312, "date": "2019-08-07", "time": "20:46:22", "tweet": "“Three more Central Banks cut rates.” Our problem is not China - We are stronger than ever, money is pouring into the U.S. while China is losing companies by the thousands to other countries, and their currency is under siege - Our problem is a Federal Reserve that is too....."}
{"id": 1158797732821291018, "date": "2019-08-07", "time": "01:51:23", "tweet": ".@sundarpichai of Google was in the Oval Office working very hard to explain how much he liked me, what a great job the Administration is doing, that Google was not involved with China’s military, that they didn’t help Crooked Hillary over me in the 2016 Election, & that they..."}
{"id": 1158718548518297600, "date": "2019-08-06", "time": "20:36:44", "tweet": "As they have learned in the last two years, our great American Farmers know that China will not be able to hurt them in that their President has stood with them and done what no other president would do - And I’ll do it again next year if necessary!"}
{"id": 1158709475517325313, "date": "2019-08-06", "time": "20:00:41", "tweet": "Massive amounts of money from China and other parts of the world is pouring into the United States for reasons of safety, investment, and interest rates! We are in a very strong position. Companies are also coming to the U.S. in big numbers. A beautiful thing to watch!"}
{"id": 1158407373666566145, "date": "2019-08-06", "time": "00:00:14", "tweet": "China is intent on continuing to receive the hundreds of Billions of Dollars they have been taking from the U.S. with unfair trade practices and currency manipulation. So one-sided, it should have been stopped many years ago!"}
{"id": 1158407058519207936, "date": "2019-08-05", "time": "23:58:59", "tweet": "Based on the historic currency manipulation by China, it is now even more obvious to everyone that Americans are not paying for the Tariffs – they are being paid for compliments of China, and the U.S. is taking in tens of Billions of Dollars! China has always...."}
{"id": 1158350120649408513, "date": "2019-08-05", "time": "20:12:44", "tweet": "China dropped the price of their currency to an almost a historic low. It’s called “currency manipulation.” Are you listening Federal Reserve? This is a major violation which will greatly weaken China over time!"}
{"id": 1157633906025402368, "date": "2019-08-03", "time": "20:46:45", "tweet": "Things are going along very well with China. They are paying us Tens of Billions of Dollars, made possible by their monetary devaluations and pumping in massive amounts of cash to keep their system going. So far our consumer is paying nothing - and no inflation. No help from Fed!"}
{"id": 1156979450560548864, "date": "2019-08-02", "time": "01:26:11", "tweet": "...We look forward to continuing our positive dialogue with China on a comprehensive Trade Deal, and feel that the future between our two countries will be a very bright one!"}
{"id": 1156979446877962243, "date": "2019-08-02", "time": "01:26:10", "tweet": "...during the talks the U.S. will start, on September 1st, putting a small additional Tariff of 10% on the remaining 300 Billion Dollars of goods and products coming from China into our Country. This does not include the 250 Billion Dollars already Tariffed at 25%..."}
{"id": 1156979443900067841, "date": "2019-08-02", "time": "01:26:09", "tweet": "Our representatives have just returned from China where they had constructive talks having to do with a future Trade Deal. We thought we had a deal with China three months ago, but sadly, China decided to re-negotiate the deal prior to signing. More recently, China agreed to..."}
{"id": 1156933712761753600, "date": "2019-08-01", "time": "22:24:26", "tweet": "China, Iran & other foreign countries are looking at the Democrat Candidates and “drooling” over the small prospect that they could be dealing with them in the not too distant future. They would be able to rip off our beloved USA like never before. With President Trump, NO WAY!"}
{"id": 1156666163310530560, "date": "2019-08-01", "time": "04:41:17", "tweet": "What the Market wanted to hear from Jay Powell and the Federal Reserve was that this was the beginning of a lengthy and aggressive rate-cutting cycle which would keep pace with China, The European Union and other countries around the world...."}
{"id": 1156182666871549952, "date": "2019-07-30", "time": "20:40:03", "tweet": "China has lost 5 million jobs and two million manufacturing jobs due to the Trump Tariffs. Trumps got China back on its heels, and the United States is doing great. @AndyPuzder @MariaBartiromo"}
{"id": 1156159999833513984, "date": "2019-07-30", "time": "19:09:59", "tweet": "China is doing very badly, worst year in 27 - was supposed to start buying our agricultural product now - no signs that they are doing so. That is the problem with China, they just don’t come through. Our Economy has become MUCH larger than the Chinese Economy is last 3 years...."}
{"id": 1155829890903617536, "date": "2019-07-29", "time": "21:18:14", "tweet": "....countries that know how to play the game against the U.S. That’s actually why the E.U. was formed....and for China, until now, the U.S. has been “easy pickens.” The Fed has made all of the wrong moves. A small rate cut is not enough, but we will win anyway!"}
{"id": 1155807406812782592, "date": "2019-07-29", "time": "19:48:54", "tweet": "The E.U. and China will further lower interest rates and pump money into their systems, making it much easier for their manufacturers to sell product. In the meantime, and with very low inflation, our Fed does nothing - and probably will do very little by comparison. Too bad!"}
{"id": 1154774656861257732, "date": "2019-07-26", "time": "23:25:07", "tweet": "Apple will not be given Tariff waiver, or relief, for Mac Pro parts that are made in China. Make them in the USA, no Tariffs!"}
{"id": 1154753932259991552, "date": "2019-07-26", "time": "22:02:46", "tweet": "There may or may not be National Security concerns with regard to Google and their relationship with China. If there is a problem, we will find out about it. I sincerely hope there is not!!!"}
{"id": 1153634372442107904, "date": "2019-07-23", "time": "19:54:02", "tweet": "Farmers are starting to do great again, after 15 years of a downward spiral. The 16 Billion Dollar China “replacement” money didn’t exactly hurt!"}
{"id": 1150717475421663233, "date": "2019-07-15", "time": "18:43:20", "tweet": "....with the U.S., and wishes it had not broken the original deal in the first place. In the meantime, we are receiving Billions of Dollars in Tariffs from China, with possibly much more to come. These Tariffs are paid for by China devaluing & pumping, not by the U.S. taxpayer!"}
{"id": 1150717474624692224, "date": "2019-07-15", "time": "18:43:19", "tweet": "China’s 2nd Quarter growth is the slowest it has been in more than 27 years. The United States Tariffs are having a major effect on companies wanting to leave China for non-tariffed countries. Thousands of companies are leaving. This is why China wants to make a deal...."}
{"id": 1149661698829234176, "date": "2019-07-12", "time": "20:48:03", "tweet": ".....if Mexico produces (which I think they will). Biggest part of deal with Mexico has not yet been revealed! China is similar, except they devalue currency & subsidize companies to lessen effect of 25% Tariffs. So far, little effect to consumers. Companies will relocate to U.S."}
{"id": 1149318492711264257, "date": "2019-07-11", "time": "22:04:16", "tweet": "Mexico is doing great at the Border, but China is letting us down in that they have not been buying the agricultural products from our great Farmers that they said they would. Hopefully they will start soon!"}
{"id": 1147486815160610817, "date": "2019-07-06", "time": "20:45:50", "tweet": "Joe Biden is a reclamation project. Some things are just not salvageable. China and other countries that ripped us off for years are begging for him. He deserted our military, our law enforcement and our healthcare. Added more debt than all other Presidents combined. Won’t win!"}
{"id": 1146423819906748416, "date": "2019-07-03", "time": "22:21:52", "tweet": "China and Europe playing big currency manipulation game and pumping money into their system in order to compete with USA. We should MATCH, or continue being the dummies who sit back and politely watch as other countries continue to play their games - as they have for many years!"}
{"id": 1145097779632627712, "date": "2019-06-30", "time": "06:32:40", "tweet": "....again with China as our relationship with them continues to be a very good one. The quality of the transaction is far more important to me than speed. I am in no hurry, but things look very good! There will be no reduction in the Tariffs currently being charged to China."}
{"id": 1145097774402342912, "date": "2019-06-30", "time": "06:32:38", "tweet": "I had a great meeting with President Xi of China yesterday, far better than expected. I agreed not to increase the already existing Tariffs that we charge China while we continue to negotiate. China has agreed that, during the negotiation, they will begin purchasing large....."}
{"id": 1144740178948493314, "date": "2019-06-29", "time": "06:51:41", "tweet": "After some very important meetings, including my meeting with President Xi of China, I will be leaving Japan for South Korea (with President Moon). While there, if Chairman Kim of North Korea sees this, I would meet him at the Border/DMZ just to shake his hand and say Hello(?)!"}
{"id": 1143128642878410752, "date": "2019-06-24", "time": "20:08:01", "tweet": "China gets 91% of its Oil from the Straight, Japan 62%, & many other countries likewise. So why are we protecting the shipping lanes for other countries (many years) for zero compensation. All of these countries should be protecting their own ships on what has always been...."}
{"id": 1140977371421564928, "date": "2019-06-18", "time": "21:39:38", "tweet": "Had a very good telephone conversation with President Xi of China. We will be having an extended meeting next week at the G-20 in Japan. Our respective teams will begin talks prior to our meeting."}
{"id": 1140935620291964928, "date": "2019-06-18", "time": "18:53:44", "tweet": "Mario Draghi just announced more stimulus could come, which immediately dropped the Euro against the Dollar, making it unfairly easier for them to compete against the USA. They have been getting away with this for years, along with China and others."}
{"id": 1139017233382985728, "date": "2019-06-13", "time": "11:50:45", "tweet": "“Biden would be China’s Dream Candidate, because there would be no more Tariffs, no more demands that China stop stealing our IP, things would go back to the old days with America’s manufacturers & workers getting shafted. He has Zero Credibility!” @IngrahamAngle  So true!"}
{"id": 1138434259637690375, "date": "2019-06-11", "time": "21:14:13", "tweet": "....If Mexico produces (which I think they will). Biggest part of deal with Mexico has not yet been revealed! China is similar, except they devalue currency and subsidize companies to lessen effect of 25% Tariff. So far, little effect to consumer. Companies will relocate to U.S."}
{"id": 1137035722043547649, "date": "2019-06-08", "time": "00:36:55", "tweet": "China is subsidizing its product in order that it can continue to be sold in the USA. Many firms are leaving China for other countries, including the United States, in order to avoid paying the Tariffs. No visible increase in costs or inflation, but U.S. is taking in Billions!"}
{"id": 1135488087453253632, "date": "2019-06-03", "time": "18:07:11", "tweet": "China is subsidizing its product in order that it can continue to be sold in the USA. Many firms are leaving China for other countries, including the United States, in order to avoid paying the Tariffs. No visible increase in costs or inflation, but U.S. is taking Billions!"}
{"id": 1134921826604331011, "date": "2019-06-02", "time": "04:37:03", "tweet": "Washington Post got it wrong, as usual. The U.S. is charging 25% against 250 Billion Dollars of goods shipped from China, not 200 BD. Also, China is paying a heavy cost in that they will subsidize goods to keep them coming, devalue their currency, yet companies are moving to....."}
{"id": 1130475280164896768, "date": "2019-05-20", "time": "22:08:04", "tweet": "Looks like Bernie Sanders is history. Sleepy Joe Biden is pulling ahead and think about it, I’m only here because of Sleepy Joe and the man who took him off the 1% trash heap, President O! China wants Sleepy Joe BADLY!"}
{"id": 1128277703570984960, "date": "2019-05-14", "time": "20:35:41", "tweet": "China will be pumping money into their system and probably reducing interest rates, as always, in order to make up for the business they are, and will be, losing. If the Federal Reserve ever did a “match,” it would be game over, we win! In any event, China wants a deal!"}
{"id": 1128261067422019584, "date": "2019-05-14", "time": "19:29:35", "tweet": "....This money will come from the massive Tariffs being paid to the United States for allowing China, and others, to do business with us. The Farmers have been “forgotten” for many years. Their time is now!"}
{"id": 1128261066654408709, "date": "2019-05-14", "time": "19:29:35", "tweet": "Our great Patriot Farmers will be one of the biggest beneficiaries of what is happening now. Hopefully China will do us the honor of continuing to buy our great farm product, the best, but if not your Country will be making up the difference based on a very high China buy......"}
{"id": 1128257892514246657, "date": "2019-05-14", "time": "19:16:58", "tweet": "....of the tremendous ground we have lost to China on Trade since the ridiculous one sided formation of the WTO. It will all happen, and much faster than people think!"}
{"id": 1128257891805298690, "date": "2019-05-14", "time": "19:16:58", "tweet": "When the time is right we will make a deal with China. My respect and friendship with President Xi is unlimited but, as I have told him many times before, this must be a great deal for the United States or it just doesn’t make any sense. We have to be allowed to make up some....."}
{"id": 1128251530442940417, "date": "2019-05-14", "time": "18:51:41", "tweet": "We can make a deal with China tomorrow, before their companies start leaving so as not to lose USA business, but the last time we were close they wanted to renegotiate the deal. No way! We are in a much better position now than any deal we could have made. Will be taking in....."}
{"id": 1128246370471694336, "date": "2019-05-14", "time": "18:31:11", "tweet": "....so that they will be more competitive for USA buyers. We are now a much bigger economy than China, and have substantially increased in size since the great 2016 Election. We are the “piggy bank” that everyone wants to raid and take advantage of. NO MORE!"}
{"id": 1128246369674829832, "date": "2019-05-14", "time": "18:31:10", "tweet": "China buys MUCH less from us than we buy from them, by almost 500 Billion Dollars, so we are in a fantastic position. Make your product at home in the USA and there is no Tariff. You can also buy from a non-Tariffed country instead of China. Many companies are leaving China....."}
{"id": 1128242506771128320, "date": "2019-05-14", "time": "18:15:50", "tweet": "In one year Tariffs have rebuilt our Steel Industry - it is booming! We placed a 25% Tariff on “dumped” steel from China & other countries, and we now have a big and growing industry. We had to save Steel for our defense and auto industries, both of which are coming back strong!"}
{"id": 1127965569821626368, "date": "2019-05-13", "time": "23:55:23", "tweet": "..There will be nobody left in China to do business with. Very bad for China, very good for USA! But China has taken so advantage of the U.S. for so many years, that they are way ahead (Our Presidents did not do the job). Therefore, China should not retaliate-will only get worse!"}
{"id": 1127965568747933696, "date": "2019-05-13", "time": "23:55:22", "tweet": "...completely avoided if you buy from a non-Tariffed Country, or you buy the product inside the USA (the best idea). That’s Zero Tariffs. Many Tariffed companies will be leaving China for Vietnam and other such countries in Asia. That’s why China wants to make a deal so badly!..."}
{"id": 1127965567359574016, "date": "2019-05-13", "time": "23:55:22", "tweet": "There is no reason for the U.S. Consumer to pay the Tariffs, which take effect on China today. This has been proven recently when only 4 points were paid by the U.S., 21 points by China because China subsidizes product to such a large degree. Also, the Tariffs can be....."}
{"id": 1127891815628144640, "date": "2019-05-13", "time": "19:02:18", "tweet": "The unexpectedly good first quarter 3.2% GDP was greatly helped by Tariffs from China. Some people just don’t get it!"}
{"id": 1127888569543077888, "date": "2019-05-13", "time": "18:49:24", "tweet": "I say openly to President Xi & all of my many friends in China that China will be hurt very badly if you don’t make a deal because companies will be forced to leave China for other countries. Too expensive to buy in China. You had a great deal, almost completed, & you backed out!"}
{"id": 1127715742898692097, "date": "2019-05-13", "time": "07:22:39", "tweet": "China is DREAMING that Sleepy Joe Biden, or any of the others, gets elected in 2020. They LOVE ripping off America!"}
{"id": 1127681373966409730, "date": "2019-05-13", "time": "05:06:05", "tweet": "....We will then spend (match or better) the money that China may no longer be spending with our Great Patriot Farmers (Agriculture), which is a small percentage of total Tariffs received, and distribute the food to starving people in nations around the world! GREAT! #MAGA"}
{"id": 1127681372896800768, "date": "2019-05-13", "time": "05:06:05", "tweet": "We are right where we want to be with China. Remember, they broke the deal with us & tried to renegotiate. We will be taking in Tens of Billions of Dollars in Tariffs from China. Buyers of product can make it themselves in the USA (ideal), or buy it from non-Tariffed countries..."}
{"id": 1127337211777757191, "date": "2019-05-12", "time": "06:18:30", "tweet": "I think that China felt they were being beaten so badly in the recent negotiation that they may as well wait around for the next election, 2020, to see if they could get lucky & have a Democrat win - in which case they would continue to rip-off the USA for $500 Billion a year...."}
{"id": 1126928410310266880, "date": "2019-05-11", "time": "03:14:04", "tweet": "....into the future will continue. In the meantime, the United States has imposed Tariffs on China, which may or may not be removed depending on what happens with respect to future negotiations!"}
{"id": 1126928408934535168, "date": "2019-05-11", "time": "03:14:04", "tweet": "Over the course of the past two days, the United States and China have held candid and constructive conversations on the status of the trade relationship between both countries. The relationship between President Xi and myself remains a very strong one, and conversations...."}
{"id": 1126844132079616002, "date": "2019-05-10", "time": "21:39:11", "tweet": "“We have been engaged in an unfair relationship with China for a long time. They have reneged on the commitments they made to the WTO, particularly around intellectual property.” Carly Fiorina @MariaBartiromo"}
{"id": 1126833126179840000, "date": "2019-05-10", "time": "20:55:27", "tweet": "Your all time favorite President got tired of waiting for China to help out and start buying from our FARMERS, the greatest anywhere in the World!"}
{"id": 1126821035146469376, "date": "2019-05-10", "time": "20:07:24", "tweet": "....If we bought 15 Billion Dollars of Agriculture from our Farmers, far more than China buys now, we would have more than 85 Billion Dollars left over for new Infrastructure, Healthcare, or anything else. China would greatly slow down, and we would automatically speed up!"}
{"id": 1126816259851673601, "date": "2019-05-10", "time": "19:48:26", "tweet": "Tariffs will make our Country MUCH STRONGER, not weaker. Just sit back and watch! In the meantime, China should not renegotiate deals with the U.S. at the last minute. This is not the Obama Administration, or the Administration of Sleepy Joe, who let China get away with “murder!”"}
{"id": 1126815129218293760, "date": "2019-05-10", "time": "19:43:56", "tweet": "....agricultural products from our Great Farmers, in larger amounts than China ever did, and ship it to poor & starving countries in the form of humanitarian assistance. In the meantime we will continue to negotiate with China in the hopes that they do not again try to redo deal!"}
{"id": 1126815128106799104, "date": "2019-05-10", "time": "19:43:56", "tweet": "....The process has begun to place additional Tariffs at 25% on the remaining 325 Billion Dollars. The U.S. only sells China approximately 100 Billion Dollars of goods & products, a very big imbalance. With the over 100 Billion Dollars in Tariffs that we take in, we will buy....."}
{"id": 1126815126584266753, "date": "2019-05-10", "time": "19:43:56", "tweet": "Talks with China continue in a very congenial manner - there is absolutely no need to rush - as Tariffs are NOW being paid to the United States by China of 25% on 250 Billion Dollars worth of goods & products. These massive payments go directly to the Treasury of the U.S...."}
{"id": 1126810275255136256, "date": "2019-05-10", "time": "19:24:39", "tweet": "We have lost 500 Billion Dollars a year, for many years, on Crazy Trade with China. NO MORE!"}
{"id": 1126229955677786113, "date": "2019-05-09", "time": "04:58:40", "tweet": "“The reality is, with the Tariffs, the economy has grown more rapidly in the United States and much more slowly in China.” Peter Morici, Former Chief Economist, USITC"}
{"id": 1126106541004873730, "date": "2019-05-08", "time": "20:48:16", "tweet": "....Guess what, that’s not going to happen! China has just informed us that they (Vice-Premier) are now coming to the U.S. to make a deal. We’ll see, but I am very happy with over $100 Billion a year in Tariffs filling U.S. coffers...great for U.S., not good for China!"}
{"id": 1126106540015071232, "date": "2019-05-08", "time": "20:48:15", "tweet": "The reason for the China pullback & attempted renegotiation of the Trade Deal is the sincere HOPE that they will be able to “negotiate” with Joe Biden or one of the very weak Democrats, and thereby continue to ripoff the United States (($500 Billion a year)) for years to come...."}
{"id": 1125356705787850753, "date": "2019-05-06", "time": "19:08:41", "tweet": "The United States has been losing, for many years, 600 to 800 Billion Dollars a year on Trade. With China we lose 500 Billion Dollars. Sorry, we’re not going to be doing that anymore!"}
{"id": 1125069836088950784, "date": "2019-05-06", "time": "00:08:46", "tweet": "....of additional goods sent to us by China remain untaxed, but will be shortly, at a rate of 25%. The Tariffs paid to the USA have had little impact on product cost, mostly borne by China. The Trade Deal with China continues, but too slowly, as they attempt to renegotiate. No!"}
{"id": 1125069835044573186, "date": "2019-05-06", "time": "00:08:46", "tweet": "For 10 months, China has been paying Tariffs to the USA of 25% on 50 Billion Dollars of High Tech, and 10% on 200 Billion Dollars of other goods. These payments are partially responsible for our great economic results. The 10% will go up to 25% on Friday. 325 Billions Dollars...."}
{"id": 1124359594418032640, "date": "2019-05-04", "time": "01:06:31", "tweet": "Had a long and very good conversation with President Putin of Russia. As I have always said, long before the Witch Hunt started, getting along with Russia, China, and everyone is a good thing, not a bad thing...."}
{"id": 1123285120864092162, "date": "2019-05-01", "time": "01:56:57", "tweet": "China is adding great stimulus to its economy while at the same time keeping interest rates low. Our Federal Reserve has incessantly lifted interest rates, even though inflation is very low, and instituted a very big dose of quantitative tightening. We have the potential to go..."}
{"id": 1113773525188395014, "date": "2019-04-04", "time": "20:01:15", "tweet": "Despite the unnecessary and destructive actions taken by the Fed, the Economy is looking very strong, the China and USMCA deals are moving along nicely, there is little or no Inflation, and USA optimism is very high!"}
{"id": 1107608921370513408, "date": "2019-03-18", "time": "19:45:19", "tweet": "....are all coming back to the U.S. So is everyone else. We now have the best Economy in the World, the envy of all. Get that big, beautiful plant in Ohio open now. Close a plant in China or Mexico, where you invested so heavily pre-Trump, but not in the U.S.A. Bring jobs home!"}
{"id": 1107025689486737410, "date": "2019-03-17", "time": "05:07:46", "tweet": "Google is helping China and their military, but not the U.S. Terrible! The good news is that they helped Crooked Hillary Clinton, and not Trump....and how did that turn out?"}
{"id": 1101620175638614016, "date": "2019-03-02", "time": "07:08:11", "tweet": "I have asked China to immediately remove all Tariffs on our agricultural products (including beef, pork, etc.) based on the fact that we are moving along nicely with Trade discussions...."}
{"id": 1100693519491100672, "date": "2019-02-27", "time": "17:45:59", "tweet": "All false reporting (guessing) on my intentions with respect to North Korea. Kim Jong Un and I will try very hard to work something out on Denuclearization & then making North Korea an Economic Powerhouse. I believe that China, Russia, Japan & South Korea will be very helpful!"}
{"id": 1100184874466664448, "date": "2019-02-26", "time": "08:04:49", "tweet": "If a deal is made with China, our great American Farmers will be treated better than they have ever been treated before!"}
{"id": 1100126391729774592, "date": "2019-02-26", "time": "04:12:25", "tweet": "China Trade Deal (and more) in advanced stages. Relationship between our two Countries is very strong. I have therefore agreed to delay U.S. tariff hikes. Let’s see what happens?"}
{"id": 1099803719435239426, "date": "2019-02-25", "time": "06:50:14", "tweet": "....productive talks, I will be delaying the U.S. increase in tariffs now scheduled for March 1. Assuming both sides make additional progress, we will be planning a Summit for President Xi and myself, at Mar-a-Lago, to conclude an agreement. A very good weekend for U.S. & China!"}
{"id": 1099800961089003522, "date": "2019-02-25", "time": "06:39:17", "tweet": "I am pleased to report that the U.S. has made substantial progress in our trade talks with China on important structural issues including intellectual property protection, technology transfer, agriculture, services, currency, and many other issues. As a result of these very......"}
{"id": 1099656646840778752, "date": "2019-02-24", "time": "21:05:49", "tweet": "President Xi of China has been very helpful in his support of my meeting with Kim Jong Un. The last thing China wants are large scale nuclear weapons right next door. Sanctions placed on the border by China and Russia have been very helpful. Great relationship with Chairman Kim!"}
{"id": 1099654763531055104, "date": "2019-02-24", "time": "20:58:20", "tweet": "Very productive talks yesterday with China on Trade. Will continue today! I will be leaving for Hanoi, Vietnam, early tomorrow for a Summit with Kim Jong Un of North Korea, where we both expect a continuation of the progress made at first Summit in Singapore. Denuclearization?"}
{"id": 1097103477329649664, "date": "2019-02-17", "time": "20:00:26", "tweet": "Important meetings and calls on China Trade Deal, and more, today with my staff. Big progress being made on soooo many different fronts! Our Country has such fantastic potential for future growth and greatness on an even higher level!"}
{"id": 1096926633708134406, "date": "2019-02-17", "time": "08:17:44", "tweet": "Trade negotiators have just returned from China where the meetings on Trade were very productive. Now at meetings with me at Mar-a-Lago giving the details. In the meantime, Billions of Dollars are being paid to the United States by China in the form of Trade Tariffs!"}
{"id": 1090987128480301056, "date": "2019-01-31", "time": "22:56:15", "tweet": "Looking for China to open their Markets not only to Financial Services, which they are now doing, but also to our Manufacturing, Farmers and other U.S. businesses and industries. Without this a deal would be unacceptable!"}
{"id": 1090957015038545920, "date": "2019-01-31", "time": "20:56:36", "tweet": "....China’s representatives and I are trying to do a complete deal, leaving NOTHING unresolved on the table. All of the many problems are being discussed and will be hopefully resolved. Tariffs on China increase to 25% on March 1st, so all working hard to complete by that date!"}
{"id": 1090953323895840768, "date": "2019-01-31", "time": "20:41:56", "tweet": "China’s top trade negotiators are in the U.S. meeting with our representatives. Meetings are going well with good intent and spirit on both sides. China does not want an increase in Tariffs and feels they will do much better if they make a deal. They are correct. I will be......"}
{"id": 1087469381586771973, "date": "2019-01-22", "time": "05:57:59", "tweet": "China posts slowest economic numbers since 1990 due to U.S. trade tensions and new policies. Makes so much sense for China to finally do a Real Deal, and stop playing around!"}
{"id": 1084938160516169729, "date": "2019-01-15", "time": "06:19:49", "tweet": "For decades, politicians promised to secure the border, fix our trade deals, bring back our factories, get tough on China, move the Embassy to Jerusalem, make NATO pay their fair share, and so much else - only to do NOTHING (or worse)...."}
{"id": 1082627015235256321, "date": "2019-01-08", "time": "21:16:09", "tweet": "Talks with China are going very well!"}
{"id": 1080997060168552448, "date": "2019-01-04", "time": "09:19:17", "tweet": "Michael Pillsbury interviewed by @cvpayne: “They have the motive of making the President look bad – instead of President Trump being portrayed as a HERO. The first President to take China on, it’s 20 years overdue...."}
{"id": 1080839254656405504, "date": "2019-01-03", "time": "22:52:13", "tweet": "The United States Treasury has taken in MANY billions of dollars from the Tariffs we are charging China and other countries that have not treated us fairly. In the meantime we are doing well in various Trade Negotiations currently going on. At some point this had to be done!"}
{"id": 1079045134061371392, "date": "2018-12-30", "time": "00:03:02", "tweet": "Just had a long and very good call with President Xi of China. Deal is moving along very well. If made, it will be very comprehensive, covering all subjects, areas and points of dispute. Big progress being made!"}
{"id": 1076125633275666433, "date": "2018-12-21", "time": "22:41:59", "tweet": "There has never been a president who has been tougher (but fair) on China or Russia - Never, just look at the facts. The Fake News tries so hard to paint the opposite picture."}
{"id": 1074657278974939138, "date": "2018-12-17", "time": "21:27:16", "tweet": "It is incredible that with a very strong dollar and virtually no inflation, the outside world blowing up around us, Paris is burning and China way down, the Fed is even considering yet another interest rate hike. Take the Victory!"}
{"id": 1073617541476569088, "date": "2018-12-15", "time": "00:35:43", "tweet": "China just announced that their economy is growing much slower than anticipated because of our Trade War with them. They have just suspended U.S. Tariff Hikes. U.S. is doing very well. China wants to make a big and very comprehensive deal. It could happen, and rather soon!"}
{"id": 1072480983683870720, "date": "2018-12-11", "time": "21:19:26", "tweet": "Very productive conversations going on with China! Watch for some important announcements!"}
{"id": 1071030014123098112, "date": "2018-12-07", "time": "21:13:48", "tweet": "China talks are going very well!"}
{"id": 1070844413910368256, "date": "2018-12-07", "time": "08:56:18", "tweet": "Statement from China: “The teams of both sides are now having smooth communications and good cooperation with each other. We are full of confidence that an agreement can be reached within the next 90 days.” I agree!"}
{"id": 1070314629732163586, "date": "2018-12-05", "time": "21:51:07", "tweet": ".....considered to be the worst and most dangerous, addictive and deadly substance of them all. Last year over 77,000 people died from Fentanyl. If China cracks down on this “horror drug,” using the Death Penalty for distributors and pushers, the results will be incredible!"}
{"id": 1070312880095068160, "date": "2018-12-05", "time": "21:44:10", "tweet": "One of the very exciting things to come out of my meeting with President Xi of China is his promise to me to criminalize the sale of deadly Fentanyl coming into the United States. It will now be considered a “controlled substance.” This could be a game changer on what is......."}
{"id": 1070306739092889601, "date": "2018-12-05", "time": "21:19:46", "tweet": "Very strong signals being sent by China once they returned home from their long trip, including stops, from Argentina. Not to sound naive or anything, but I believe President Xi meant every word of what he said at our long and hopefully historic meeting. ALL subjects discussed!"}
{"id": 1070299196538961920, "date": "2018-12-05", "time": "20:49:48", "tweet": ".....China had agreed to start “immediately” buying U.S. products.” @business"}
{"id": 1070298360572198913, "date": "2018-12-05", "time": "20:46:28", "tweet": "“China officially echoed President Donald Trump’s optimism over bilateral trade talks. Chinese officials have begun preparing to restart imports of U.S. Soybeans & Liquified Natural Gas, the first sign confirming the claims of President Donald Trump and the White House that......"}
{"id": 1070110927788347393, "date": "2018-12-05", "time": "08:21:41", "tweet": ".....China does not want Tariffs!"}
{"id": 1070110615627333632, "date": "2018-12-05", "time": "08:20:27", "tweet": "We are either going to have a REAL DEAL with China, or no deal at all - at which point we will be charging major Tariffs against Chinese product being shipped into the United States. Ultimately, I believe, we will be making a deal - either now or into the future...."}
{"id": 1069972093301862406, "date": "2018-12-04", "time": "23:10:00", "tweet": ".....But if a fair deal is able to be made with China, one that does all of the many things we know must be finally done, I will happily sign. Let the negotiations begin. MAKE AMERICA GREAT AGAIN!"}
{"id": 1069968462724980736, "date": "2018-12-04", "time": "22:55:35", "tweet": "......on seeing whether or not a REAL deal with China is actually possible. If it is, we will get it done. China is supposed to start buying Agricultural product and more immediately. President Xi and I want this deal to happen, and it probably will. But if not remember,......"}
{"id": 1069962093301022720, "date": "2018-12-04", "time": "22:30:16", "tweet": "The negotiations with China have already started. Unless extended, they will end 90 days from the date of our wonderful and very warm dinner with President Xi in Argentina. Bob Lighthizer will be working closely with Steve Mnuchin, Larry Kudlow, Wilbur Ross and Peter Navarro....."}
{"id": 1069581524180324352, "date": "2018-12-03", "time": "21:18:01", "tweet": "President Xi and I have a very strong and personal relationship. He and I are the only two people that can bring about massive and very positive change, on trade and far beyond, between our two great Nations. A solution for North Korea is a great thing for China and ALL!"}
{"id": 1069577273819443200, "date": "2018-12-03", "time": "21:01:08", "tweet": "Farmers will be a a very BIG and FAST beneficiary of our deal with China. They intend to start purchasing agricultural product immediately. We make the finest and cleanest product in the World, and that is what China wants. Farmers, I LOVE YOU!"}
{"id": 1069575605199482881, "date": "2018-12-03", "time": "20:54:30", "tweet": "My meeting in Argentina with President Xi of China was an extraordinary one. Relations with China have taken a BIG leap forward! Very good things will happen. We are dealing from great strength, but China likewise has much to gain if and when a deal is completed. Level the field!"}
{"id": 1069441198157455360, "date": "2018-12-03", "time": "12:00:25", "tweet": "China has agreed to reduce and remove tariffs on cars coming into China from the U.S. Currently the tariff is 40%."}
{"id": 1068120444279103488, "date": "2018-11-29", "time": "20:32:13", "tweet": "Billions of Dollars are pouring into the coffers of the U.S.A. because of the Tariffs being charged to China, and there is a long way to go. If companies don’t want to pay Tariffs, build in the U.S.A. Otherwise, lets just make our Country richer than ever before!"}
{"id": 1067494682249318402, "date": "2018-11-28", "time": "03:05:39", "tweet": "....for electric cars. General Motors made a big China bet years ago when they built plants there (and in Mexico) - don’t think that bet is going to pay off. I am here to protect America’s Workers!"}
{"id": 1067494680416407552, "date": "2018-11-28", "time": "03:05:39", "tweet": "Very disappointed with General Motors and their CEO, Mary Barra, for closing plants in Ohio, Michigan and Maryland. Nothing being closed in Mexico & China. The U.S. saved General Motors, and this is the THANKS we get! We are now looking at cutting all @GM subsidies, including...."}
{"id": 1062311785787744256, "date": "2018-11-13", "time": "19:50:41", "tweet": "Emmanuel Macron suggests building its own army to protect Europe against the U.S., China and Russia. But it was Germany in World Wars One & Two - How did that work out for France? They were starting to learn German in Paris before the U.S. came along. Pay for NATO or not!"}
{"id": 1061003186125856769, "date": "2018-11-10", "time": "05:10:46", "tweet": "President Macron of France has just suggested that Europe build its own military in order to protect itself from the U.S., China and Russia. Very insulting, but perhaps Europe should first pay its fair share of NATO, which the U.S. subsidizes greatly!"}
{"id": 1057997981922873344, "date": "2018-11-01", "time": "22:09:10", "tweet": "Just had a long and very good conversation with President Xi Jinping of China. We talked about many subjects, with a heavy emphasis on Trade. Those discussions are moving along nicely with meetings being scheduled at the G-20 in Argentina. Also had good discussion on North Korea!"}
{"id": 1055458320390217728, "date": "2018-10-25", "time": "21:57:27", "tweet": "The New York Times has a new Fake Story that now the Russians and Chinese (glad they finally added China) are listening to all of my calls on cellphones. Except that I rarely use a cellphone, & when I do it’s government authorized. I like Hard Lines. Just more made up Fake News!"}
{"id": 1045001780092956672, "date": "2018-09-27", "time": "01:26:54", "tweet": "China is actually placing propaganda ads in the Des Moines Register and other papers, made to look like news. That’s because we are beating them on Trade, opening markets, and the farmers will make a fortune when this is over!  pic.twitter.com/ppdvTX7oz1"}
{"id": 1042034269374361600, "date": "2018-09-18", "time": "20:55:04", "tweet": ".....China has been taking advantage of the United States on Trade for many years. They also know that I am the one that knows how to stop it. There will be great and fast economic retaliation against China if our farmers, ranchers and/or industrial workers are targeted!"}
{"id": 1042033116695670786, "date": "2018-09-18", "time": "20:50:29", "tweet": "China has openly stated that they are actively trying to impact and change our election by attacking our farmers, ranchers and industrial workers because of their loyalty to me. What China does not understand is that these people are great patriots and fully understand that....."}
{"id": 1040242677877551104, "date": "2018-09-13", "time": "22:15:55", "tweet": "The Wall Street Journal has it wrong, we are under no pressure to make a deal with China, they are under pressure to make a deal with us. Our markets are surging, theirs are collapsing. We will soon be taking in Billions in Tariffs & making products at home. If we meet, we meet?"}
{"id": 1038789398140084224, "date": "2018-09-09", "time": "22:01:06", "tweet": "If the U.S. sells a car into China, there is a tax of 25%. If China sells a car into the U.S., there is a tax of 2%. Does anybody think that is FAIR? The days of the U.S. being ripped-off by other nations is OVER!"}
{"id": 1038453273286664193, "date": "2018-09-08", "time": "23:45:28", "tweet": "Apple prices may increase because of the massive Tariffs we may be imposing on China - but there is an easy solution where there would be ZERO tax, and indeed a tax incentive. Make your products in the United States instead of China. Start building new plants now. Exciting! #MAGA"}
{"id": 1034914379391807488, "date": "2018-08-30", "time": "05:23:10", "tweet": "...differences, they will be resolved in time by President Trump and China’s great President Xi Jinping. Their relationship and bond remain very strong."}
{"id": 1034914377768620037, "date": "2018-08-30", "time": "05:23:10", "tweet": "...of money on joint U.S.-South Korea war games. Besides, the President can instantly start the joint exercises again with South Korea, and Japan, if he so chooses. If he does, they will be far bigger than ever before. As for the U.S.–China trade disputes, and other..."}
{"id": 1034914371099676674, "date": "2018-08-30", "time": "05:23:08", "tweet": "STATEMENT FROM THE WHITE HOUSE  President Donald J. Trump feels strongly that North Korea is under tremendous pressure from China because of our major trade disputes with the Chinese Government. At the same time, we also know that China is providing North Korea with..."}
{"id": 1034654816046329856, "date": "2018-08-29", "time": "12:11:45", "tweet": "Hillary Clinton’s Emails, many of which are Classified Information, got hacked by China. Next move better be by the FBI & DOJ or, after all of their other missteps (Comey, McCabe, Strzok, Page, Ohr, FISA, Dirty Dossier etc.), their credibility will be forever gone!"}
{"id": 1034610829860261895, "date": "2018-08-29", "time": "09:16:58", "tweet": "Report just out: “China hacked Hillary Clinton’s private Email Server.” Are they sure it wasn’t Russia (just kidding!)? What are the odds that the FBI and DOJ are right on top of this? Actually, a very big story. Much classified information!"}
{"id": 1033045280143355904, "date": "2018-08-25", "time": "01:36:02", "tweet": "...Secretary Pompeo looks forward to going to North Korea in the near future, most likely after our Trading relationship with China is resolved. In the meantime I would like to send my warmest regards and respect to Chairman Kim. I look forward to seeing him soon!"}
{"id": 1033045274866999297, "date": "2018-08-25", "time": "01:36:01", "tweet": "...Additionally, because of our much tougher Trading stance with China, I do not believe they are helping with the process of denuclearization as they once were (despite the UN Sanctions which are in place)..."}
{"id": 1031590431379865600, "date": "2018-08-21", "time": "01:14:59", "tweet": "It is outrageous that Poisonous Synthetic Heroin Fentanyl comes pouring into the U.S. Postal System from China. We can, and must, END THIS NOW! The Senate should pass the STOP ACT – and firmly STOP this poison from killing our children and destroying our country. No more delay!"}
{"id": 1030782921500766209, "date": "2018-08-18", "time": "19:46:14", "tweet": "All of the fools that are so focused on looking only at Russia should start also looking in another direction, China. But in the end, if we are smart, tough and well prepared, we will get along with everyone!"}
{"id": 1027214330503352320, "date": "2018-08-08", "time": "23:25:55", "tweet": "As long as I campaign and/or support Senate and House candidates (within reason), they will win! I LOVE the people, & they certainly seem to like the job I’m doing. If I find the time, in between China, Iran, the Economy and much more, which I must, we will have a giant Red Wave!"}
{"id": 1025834673736482817, "date": "2018-08-05", "time": "04:03:39", "tweet": "....China, which is for the first time doing poorly against us, is spending a fortune on ads and P.R. trying to convince and scare our politicians to fight me on Tariffs- because they are really hurting their economy. Likewise other countries. We are Winning, but must be strong!"}
{"id": 1025830647649247232, "date": "2018-08-05", "time": "03:47:40", "tweet": "Tariffs are working far better than anyone ever anticipated. China market has dropped 27% in last 4months, and they are talking to us. Our market is stronger than ever, and will go up dramatically when these horrible Trade Deals are successfully renegotiated. America First......."}
{"id": 1022079127799701504, "date": "2018-07-25", "time": "19:20:28", "tweet": "China is targeting our farmers, who they know I love & respect, as a way of getting me to continue allowing them to take advantage of the U.S. They are being vicious in what will be their failed attempt. We were being nice - until now! China made $517 Billion on us last year."}
{"id": 1020287981020729344, "date": "2018-07-20", "time": "20:43:05", "tweet": "China, the European Union and others have been manipulating their currencies and interest rates lower, while the U.S. is raising rates while the dollars gets stronger and stronger with each passing day - taking away our big competitive edge. As usual, not a level playing field..."}
{"id": 1016327387154395138, "date": "2018-07-09", "time": "22:25:06", "tweet": "I have confidence that Kim Jong Un will honor the contract we signed &, even more importantly, our handshake. We agreed to the denuclearization of North Korea. China, on the other hand, may be exerting negative pressure on a deal because of our posture on Chinese Trade-Hope Not!"}
{"id": 1003634405036961793, "date": "2018-06-04", "time": "21:47:43", "tweet": "Farmers have not been doing well for 15 years. Mexico, Canada, China and others have treated them unfairly. By the time I finish trade talks, that will change. Big trade barriers against U.S. farmers, and other businesses, will finally be broken. Massive trade deficits no longer!"}
{"id": 1003617811254710273, "date": "2018-06-04", "time": "20:41:47", "tweet": "China already charges a tax of 16% on soybeans. Canada has all sorts of trade barriers on our Agricultural products. Not acceptable!"}
{"id": 1002951786301415424, "date": "2018-06-03", "time": "00:35:14", "tweet": "Very surprised that China would be doing this?  https://twitter.com/nytimes/status/1002760314734170113 …"}
{"id": 999257533327073281, "date": "2018-05-23", "time": "19:55:35", "tweet": "Our Trade Deal with China is moving along nicely, but in the end we will probably have to use a different structure in that this will be too hard to get done and to verify results after completion."}
{"id": 998553122179084290, "date": "2018-05-21", "time": "21:16:31", "tweet": "Under our potential deal with China, they will purchase from our Great American Farmers practically as much as our Farmers can produce."}
{"id": 998528928259170305, "date": "2018-05-21", "time": "19:40:22", "tweet": "China must continue to be strong & tight on the Border of North Korea until a deal is made. The word is that recently the Border has become much more porous and more has been filtering in. I want this to happen, and North Korea to be VERY successful, but only after signing!"}
{"id": 998526637657546753, "date": "2018-05-21", "time": "19:31:16", "tweet": "On China, Barriers and Tariffs to come down for first time."}
{"id": 998525737593376768, "date": "2018-05-21", "time": "19:27:42", "tweet": "China has agreed to buy massive amounts of ADDITIONAL Farm/Agricultural Products - would be one of the best things to happen to our farmers in many years!"}
{"id": 998524172858019840, "date": "2018-05-21", "time": "19:21:29", "tweet": "I ask Senator Chuck Schumer, why didn’t President Obama & the Democrats do something about Trade with China, including Theft of Intellectual Property etc.? They did NOTHING! With that being said, Chuck & I have long agreed on this issue! Fair Trade, plus, with China will happen!"}
{"id": 997227223638790144, "date": "2018-05-18", "time": "05:27:52", "tweet": "Talking trade with the Vice Premier of the People’s Republic of China, Liu He.  pic.twitter.com/9T7Iq6F3Xe"}
{"id": 996739376028835840, "date": "2018-05-16", "time": "21:09:20", "tweet": "...haven’t even started yet! The U.S. has very little to give, because it has given so much over the years. China has much to give!"}
{"id": 996739374619426816, "date": "2018-05-16", "time": "21:09:20", "tweet": "...We have not seen China’s demands yet, which should be few in that previous U.S. Administrations have done so poorly in negotiating. China has seen our demands. There has been no folding as the media would love people to believe, the meetings..."}
{"id": 996739372723638272, "date": "2018-05-16", "time": "21:09:19", "tweet": "The Washington Post and CNN have typically written false stories about our trade negotiations with China. Nothing has happened with ZTE except as it pertains to the larger trade deal. Our country has been losing hundreds of billions of dollars a year with China..."}
{"id": 996368474556583937, "date": "2018-05-15", "time": "20:35:30", "tweet": "Trade negotiations are continuing with China. They have been making hundreds of billions of dollars a year from the U.S., for many years. Stay tuned!"}
{"id": 996119678551552000, "date": "2018-05-15", "time": "04:06:53", "tweet": "ZTE, the large Chinese phone company, buys a big percentage of individual parts from U.S. companies. This is also reflective of the larger trade deal we are negotiating with China and my personal relationship with President Xi."}
{"id": 995746011321597953, "date": "2018-05-14", "time": "03:22:03", "tweet": "China and the United States are working well together on trade, but past negotiations have been so one sided in favor of China, for so many years, that it is hard for them to make a deal that benefits both countries. But be cool, it will all work out!"}
{"id": 995680316458262533, "date": "2018-05-13", "time": "23:01:00", "tweet": "President Xi of China, and I, are working together to give massive Chinese phone company, ZTE, a way to get back into business, fast. Too many jobs in China lost. Commerce Department has been instructed to get it done!"}
{"id": 993813485745295360, "date": "2018-05-08", "time": "19:22:53", "tweet": "I will be speaking to my friend, President Xi of China, this morning at 8:30. The primary topics will be Trade, where good things will happen, and North Korea, where relationships and trust are building."}
{"id": 992562394051293186, "date": "2018-05-05", "time": "08:31:30", "tweet": "Our high level delegation is on the way back from China where they had long meetings with Chinese leaders and business representatives. We will be meeting tomorrow to determine the results, but it is hard for China in that they have become very spoiled with U.S. trade wins!"}
{"id": 991886413686861824, "date": "2018-05-03", "time": "11:45:24", "tweet": "Our great financial team is in China trying to negotiate a level playing field on trade! I look forward to being with President Xi in the not too distant future. We will always have a good (great) relationship!"}
{"id": 991809653980966913, "date": "2018-05-03", "time": "06:40:23", "tweet": "“This isn’t some game. You are screwing with the work of the president of the United States.”  John Dowd, March 2018.  With North Korea, China, the Middle East and so much more, there is not much time to be thinking about this, especially since there was no Russian “Collusion.”"}
{"id": 991644756995444736, "date": "2018-05-02", "time": "19:45:08", "tweet": "There was no Collusion (it is a Hoax) and there is no Obstruction of Justice (that is a setup & trap). What there is is Negotiations going on with North Korea over Nuclear War, Negotiations going on with China over Trade Deficits, Negotiations on NAFTA, and much more. Witch Hunt!"}
{"id": 991271009570484224, "date": "2018-05-01", "time": "19:00:00", "tweet": "Delegation heading to China to begin talks on the Massive Trade Deficit that has been created with our Country. Very much like North Korea, this should have been fixed years ago, not now. Same with other countries and NAFTA...but it will all get done. Great Potential for USA!"}
{"id": 989834048796266498, "date": "2018-04-27", "time": "19:50:02", "tweet": "Please do not forget the great help that my good friend, President Xi of China, has given to the United States, particularly at the Border of North Korea. Without him it would have been a much longer, tougher, process!"}
{"id": 985858100149309441, "date": "2018-04-16", "time": "20:31:02", "tweet": "Russia and China are playing the Currency Devaluation game as the U.S. keeps raising interest rates. Not acceptable!"}
{"id": 984017894240604161, "date": "2018-04-11", "time": "18:38:42", "tweet": "So much Fake News about what is going on in the White House. Very calm and calculated with a big focus on open and fair trade with China, the coming North Korea meeting and, of course, the vicious gas attack in Syria. Feels great to have Bolton & Larry K on board. I (we) are"}
{"id": 983774270886236161, "date": "2018-04-11", "time": "02:30:38", "tweet": "Very thankful for President Xi of China’s kind words on tariffs and automobile barriers...also, his enlightenment on intellectual property and technology transfers. We will make great progress together!"}
{"id": 983284198046826496, "date": "2018-04-09", "time": "18:03:16", "tweet": "When a car is sent to the United States from China, there is a Tariff to be paid of 2 1/2%. When a car is sent to China from the United States, there is a Tariff to be paid of 25%. Does that sound like free or fair trade.  No, it sounds like STUPID TRADE -  going on for years!"}
{"id": 982954355509907457, "date": "2018-04-08", "time": "20:12:35", "tweet": "President Xi and I will always be friends, no matter what happens with our dispute on trade. China will take down its Trade Barriers because it is the right thing to do. Taxes will become Reciprocal & a deal will be made on Intellectual Property. Great future for both countries!"}
{"id": 982680387116781568, "date": "2018-04-08", "time": "02:03:56", "tweet": "The United States hasn’t had a Trade Surplus with China in 40 years. They must end unfair trade, take down barriers and charge only Reciprocal Tariffs. The U.S. is losing $500 Billion a year, and has been losing Billions of Dollars for decades. Cannot continue!"}
{"id": 982264844136017921, "date": "2018-04-06", "time": "22:32:43", "tweet": "China, which is a great economic power, is considered a Developing Nation within the World Trade Organization. They therefore get tremendous perks and advantages, especially over the U.S. Does anybody think this is fair. We were badly represented. The WTO is unfair to U.S."}
{"id": 981881669593559040, "date": "2018-04-05", "time": "21:10:07", "tweet": "The Fake News Washington Post, Amazon’s “chief lobbyist,” has another (of many) phony headlines, “Trump Defiant As China Adds Trade Penalties.” WRONG! Should read, “Trump Defiant as U.S. Adds Trade Penalties, Will End Barriers And Massive  I.P. Theft.” Typically bad reporting!"}
{"id": 981492087328792577, "date": "2018-04-04", "time": "19:22:03", "tweet": "We are not in a trade war with China, that war was lost many years ago by the foolish, or incompetent, people who represented the U.S. Now we have a Trade Deficit of $500 Billion a year, with Intellectual Property Theft of another $300 Billion. We cannot let this continue!"}
{"id": 978938860582440960, "date": "2018-03-28", "time": "18:16:26", "tweet": "Received message last night from XI JINPING of China that his meeting with KIM JONG UN went very well and that KIM looks forward to his meeting with me. In the meantime, and unfortunately, maximum sanctions and pressure must be maintained at all cost!"}
{"id": 972506194978983937, "date": "2018-03-11", "time": "00:15:19", "tweet": "Chinese President XI JINPING and I spoke at length about the meeting with KIM JONG UN of North Korea. President XI told me he appreciates that the U.S. is working to solve the problem diplomatically rather than going with the ominous alternative. China continues to be helpful!"}
{"id": 971402791930552322, "date": "2018-03-07", "time": "23:10:48", "tweet": "China has been asked to develop a plan for the year of a One Billion Dollar reduction in their massive Trade Deficit with the United States. Our relationship with China has been a very good one, and we look forward to seeing what ideas they come back with. We must act soon!"}
{"id": 965202556204003328, "date": "2018-02-18", "time": "20:33:16", "tweet": "I never said Russia did not meddle in the election, I said “it may be Russia, or China or another country or group, or it may be a 400 pound genius sitting in bed and playing with his computer.” The Russian “hoax” was that the Trump campaign colluded with Russia - it never did!"}
{"id": 961671974153080834, "date": "2018-02-09", "time": "02:44:00", "tweet": "I will be meeting with Henry Kissinger at 1:45pm. Will be discussing North Korea, China and the Middle East."}
{"id": 946416486054285314, "date": "2017-12-29", "time": "00:24:08", "tweet": "Caught RED HANDED - very disappointed that China is allowing oil to go into North Korea. There will never be a friendly solution to the North Korea problem if this continues to happen!"}
{"id": 936209447747190784, "date": "2017-11-30", "time": "20:25:00", "tweet": "The Chinese Envoy, who just returned from North Korea, seems to have had no impact on Little Rocket Man. Hard to believe his people, and the military, put up with living in such horrible conditions. Russia and China condemned the launch."}
{"id": 935881037254725632, "date": "2017-11-29", "time": "22:40:01", "tweet": "Just spoke to President XI JINPING of China concerning the provocative actions of North Korea. Additional major sanctions will be imposed on North Korea today. This situation will be handled!"}
{"id": 933282274937733126, "date": "2017-11-22", "time": "18:33:28", "tweet": "...LaVar, you could have spent the next 5 to 10 years during Thanksgiving with your son in China, but no NBA contract to support you. But remember LaVar, shoplifting is NOT a little thing. It’s a really big deal, especially in China. Ungrateful fool!"}
{"id": 933280234220134401, "date": "2017-11-22", "time": "18:25:22", "tweet": "It wasn’t the White House, it wasn’t the State Department, it wasn’t father LaVar’s so-called people on the ground in China that got his son out of a long term prison sentence - IT WAS ME. Too bad! LaVar is just a poor man’s version of Don King, but without the hair. Just think.."}
{"id": 932392209445457920, "date": "2017-11-20", "time": "07:36:40", "tweet": "Shoplifting is a very big deal in China, as it should be (5-10 years in jail), but not to father LaVar. Should have gotten his son out during my next trip to China instead. China told them why they were released. Very ungrateful!"}
{"id": 932303108146892801, "date": "2017-11-20", "time": "01:42:36", "tweet": "Now that the three basketball players are out of China and saved from years in jail, LaVar Ball, the father of LiAngelo, is unaccepting of what I did for his son and that shoplifting is no big deal. I should have left them in jail!"}
{"id": 931140567089721344, "date": "2017-11-16", "time": "20:43:05", "tweet": "China is sending an Envoy and Delegation to North Korea - A big move, we'll see what happens!"}
{"id": 931122234437046272, "date": "2017-11-16", "time": "19:30:14", "tweet": "To the three UCLA basketball players I say:  You're welcome, go out and give a big Thank You to President Xi Jinping of China who made....."}
{"id": 930836707095863296, "date": "2017-11-16", "time": "00:35:39", "tweet": "The failing @nytimes hates the fact that I have developed a great relationship with World leaders like Xi Jinping, President of China....."}
{"id": 929503025512693760, "date": "2017-11-12", "time": "08:16:05", "tweet": "Met with President Putin of Russia who was at #APEC meetings. Good discussions on Syria. Hope for his help to solve, along with China the dangerous North Korea crisis. Progress being made."}
{"id": 929492038231429120, "date": "2017-11-12", "time": "07:32:25", "tweet": "President Xi of China has stated that he is upping the sanctions against #NoKo. Said he wants them to denuclearize. Progress is being made."}
{"id": 928793643367960576, "date": "2017-11-10", "time": "09:17:15", "tweet": "I am leaving China for #APEC2017 in Vietnam. @FLOTUS Melania is staying behind to see the zoo, and of course, the Great WALL of China before going to Alaska to greet our AMAZING troops."}
{"id": 928769154345324544, "date": "2017-11-10", "time": "07:39:56", "tweet": "I don’t blame China, I blame the incompetence of past Admins for allowing China to take advantage of the U.S. on trade leading up to a point where the U.S. is losing $100's of billions. How can you blame China for taking advantage of people that had no clue? I would've done same!"}
{"id": 928622838487007260, "date": "2017-11-09", "time": "21:58:32", "tweet": "In the coming months and years ahead I look forward to building an even STRONGER relationship between the United States and China. 🇺🇸🇨🇳  pic.twitter.com/mK3SB7t3EV"}
{"id": 928286153672970240, "date": "2017-11-08", "time": "23:40:40", "tweet": "Looking forward to a full day of meetings with President Xi and our delegations tomorrow. THANK YOU for the beautiful welcome China! @FLOTUS Melania and I will never forget it! pic.twitter.com/sQoUWIGAiQ"}
{"id": 928124338343202816, "date": "2017-11-08", "time": "12:57:40", "tweet": "Leaving South Korea now heading to China. Looking very much forward to meeting and being with President Xi!"}
{"id": 928064591665467393, "date": "2017-11-08", "time": "09:00:15", "tweet": "Getting ready to make a major speech to the National Assembly here in South Korea, then will be headed to China where I very much look forward to meeting with President Xi who is just off his great political victory."}
{"id": 926460439000698880, "date": "2017-11-03", "time": "22:45:56", "tweet": "Just took off for ceremony @ Pearl Harbor. Will then be heading to Japan, SKorea, China, Vietnam & the Philippines. Will never let you down!"}
{"id": 923272793457913857, "date": "2017-10-26", "time": "03:39:22", "tweet": "Melania and I look forward to being with President Xi & Madame Peng Liyuan in China in two weeks for what will hopefully be a historic trip!  pic.twitter.com/uFMonzza7N"}
{"id": 923268967728386049, "date": "2017-10-26", "time": "03:24:10", "tweet": "Spoke to President Xi of China to congratulate him on his extraordinary elevation. Also discussed NoKo & trade, two very important subjects!"}
{"id": 908154067658174469, "date": "2017-09-14", "time": "10:22:57", "tweet": "China has a business tax rate of 15%. We should do everything possible to match them in order to win with our economy. Jobs and wages!"}
{"id": 904307898213433344, "date": "2017-09-03", "time": "19:39:38", "tweet": "..North Korea is a rogue nation which has become a great threat and embarrassment to China, which is trying to help but with little success."}
{"id": 893965986566733824, "date": "2017-08-06", "time": "06:44:34", "tweet": "The United Nations Security Council just voted 15-0 to sanction North Korea. China and Russia voted with us. Very big financial impact!"}
{"id": 891442016294494209, "date": "2017-07-30", "time": "07:35:13", "tweet": "...they do NOTHING for us with North Korea, just talk. We will no longer allow this to continue. China could easily solve this problem!"}
{"id": 891440474132795392, "date": "2017-07-30", "time": "07:29:05", "tweet": "I am very disappointed in China. Our foolish past leaders have allowed them to make hundreds of billions of dollars a year in trade, yet..."}
{"id": 883761448064864257, "date": "2017-07-09", "time": "02:55:23", "tweet": "Leaving Hamburg for Washington, D.C. and the WH. Just left China’s President Xi where we had an excellent meeting on trade & North Korea."}
{"id": 882560030884716544, "date": "2017-07-05", "time": "19:21:23", "tweet": "Trade between China and North Korea grew almost 40% in the first quarter. So much for China working with us - but we had to give it a try!"}
{"id": 882062572081512449, "date": "2017-07-04", "time": "10:24:39", "tweet": "....and Japan will put up with this much longer. Perhaps China will put a heavy move on North Korea and end this nonsense once and for all!"}
{"id": 877234140483121152, "date": "2017-06-21", "time": "02:38:11", "tweet": "While I greatly appreciate the efforts of President Xi & China to help with North Korea, it has not worked out. At least I know China tried!"}
{"id": 869166145894535169, "date": "2017-05-29", "time": "20:18:52", "tweet": "North Korea has shown great disrespect for their neighbor, China, by shooting off yet another ballistic missile...but China is trying hard!"}
{"id": 863020954427043840, "date": "2017-05-12", "time": "21:20:04", "tweet": "China just agreed that the U.S. will be allowed to sell beef, and other major products, into China once again. This is REAL news!"}
{"id": 858100088253669376, "date": "2017-04-29", "time": "07:26:18", "tweet": "North Korea disrespected the wishes of China & its highly respected President when it launched, though unsuccessfully, a missile today. Bad!"}
{"id": 855406847200768000, "date": "2017-04-21", "time": "21:04:19", "tweet": "China is very much the economic lifeline to North Korea so, while nothing is easy, if they want to solve the North Korean problem, they will"}
{"id": 853583417916755968, "date": "2017-04-16", "time": "20:18:40", "tweet": "Why would I call China a currency manipulator when they are working with us on the North Korean problem? We will see what happens!"}
{"id": 852508752142114816, "date": "2017-04-13", "time": "21:08:20", "tweet": "I have great confidence that China will properly deal with North Korea. If they are unable to do so, the U.S., with its allies, will! U.S.A."}
{"id": 852134796436398086, "date": "2017-04-12", "time": "20:22:22", "tweet": "Had a very good call last night with the President of China concerning the menace of North Korea."}
{"id": 851767718248361986, "date": "2017-04-11", "time": "20:03:43", "tweet": "North Korea is looking for trouble. If China decides to help, that would be great. If not, we will solve the problem without them!  U.S.A."}
{"id": 851766546825347076, "date": "2017-04-11", "time": "19:59:04", "tweet": "I explained to the President of China that a trade deal with the U.S. will be far better for them if they solve the North Korean problem!"}
{"id": 850722648883638272, "date": "2017-04-08", "time": "22:50:59", "tweet": "It was a great honor to have President Xi Jinping and Madame Peng Liyuan of China as our guests in the United States. Tremendous..."}
{"id": 847573220417044480, "date": "2017-03-31", "time": "06:16:17", "tweet": "The meeting next week with China will be a very difficult one in that we can no longer have massive trade deficits..."}
{"id": 842724011234791424, "date": "2017-03-17", "time": "21:07:15", "tweet": "North Korea is behaving very badly. They have been \"playing\" the United States for years. China has done little to help!"}
{"id": 830047626414477312, "date": "2017-02-10", "time": "21:35:50", "tweet": "The failing @nytimes does major FAKE NEWS China story saying \"Mr.Xi has not spoken to Mr. Trump since Nov.14.\" We spoke at length yesterday!"}
{"id": 816068355555815424, "date": "2017-01-03", "time": "07:47:12", "tweet": "China has been taking out massive amounts of money & wealth from the U.S. in totally one-sided trade, but won't help with North Korea. Nice!"}
{"id": 810288321880555520, "date": "2016-12-18", "time": "08:59:25", "tweet": "We should tell China that we don't want the drone they stole back.- let them keep it!"}
{"id": 810121703288410112, "date": "2016-12-17", "time": "21:57:20", "tweet": "China steals United States Navy research drone in international waters - rips it out of water and takes it to China in unprecedented act."}
{"id": 805539770864693253, "date": "2016-12-05", "time": "06:30:22", "tweet": "their country (the U.S. doesn't tax them) or to build a massive military complex in the middle of the South China Sea?  I don't think so!"}
{"id": 805538149157969924, "date": "2016-12-05", "time": "06:23:55", "tweet": "Did China ask us if it was OK to devalue their currency (making it hard for our companies to compete), heavily tax our products going into.."}
{"id": 798862483255652352, "date": "2016-11-16", "time": "20:17:12", "tweet": "I have recieved and taken calls from many foreign leaders despite what the failing @nytimes said. Russia, U.K., China, Saudi Arabia, Japan,"}
{"id": 773116580733587456, "date": "2016-09-06", "time": "19:12:11", "tweet": "China wouldn't provide a red carpet stairway from Air Force One and then Philippines President calls Obama \"the son of a whore.\" Terrible!"}
{"id": 748141420528140288, "date": "2016-06-29", "time": "21:09:49", "tweet": "The @USCHAMBER must fight harder for the American worker. China, and many others, are taking advantage of U.S. with our terrible trade pacts"}
{"id": 745294739092684800, "date": "2016-06-22", "time": "00:38:07", "tweet": "Hillary Clinton surged the trade deficit with China 40% as Secretary of State, costing Americans millions of jobs."}
{"id": 733594906447372292, "date": "2016-05-20", "time": "17:47:09", "tweet": "Crooked Hillary has zero imagination and even less stamina. ISIS, China, Russia and all would love for her to be president. 4 more years!"}
{"id": 732537744195522560, "date": "2016-05-17", "time": "19:46:22", "tweet": "Crooked Hillary Clinton put out an ad where I am misquoted on women. Can't believe she would misrepresent the facts! My hit was on China"}
{"id": 732535400498143232, "date": "2016-05-17", "time": "19:37:03", "tweet": "The pathetic new hit ad against me misrepresents the final line. \"You can tell them to go BLANK themselves\" - was about China, NOT WOMEN!"}
{"id": 731288678451019776, "date": "2016-05-14", "time": "09:03:02", "tweet": "If Crooked Hillary Clinton can't close the deal on Crazy Bernie, how is she going to take on China, Russia, ISIS and all of the others?"}
{"id": 729404337164783617, "date": "2016-05-09", "time": "04:15:20", "tweet": "Crooked Hillary just can't close the deal with Bernie. It will be the same way with ISIS, and China on trade, and Mexico at the border. Bad!"}
{"id": 684217554861199360, "date": "2016-01-05", "time": "11:39:11", "tweet": "\"@iLoveiDevices: @EdwinRo47796972 @happyjack225 @FoxNews @krauthammer  Minimizing dependency on China is crucial.Only Trump talks about that"}
{"id": 664820082325893121, "date": "2015-11-12", "time": "23:00:34", "tweet": ".@KarlRove is a biased dope who wrote falsely about me re China and TPP. This moron wasted $430 million on political campaigns and lost 100%"}
{"id": 664769890604175361, "date": "2015-11-12", "time": "19:41:07", "tweet": ".@WSJ Editorial Board should review my debate statement re China and T.P.P. and apologize. China not part but will get their way in later."}
{"id": 664768772683776000, "date": "2015-11-12", "time": "19:36:40", "tweet": "Today's @WSJ Editorial is WRONG again. I know that China is not in the new T.P.P. trade deal but would come in latter through a back door."}
{"id": 664578302447902720, "date": "2015-11-12", "time": "06:59:49", "tweet": "I never said that China was in the bad TPP trade deal but that China would come in the back door at a later date. @CNN @FoxBusiness"}
{"id": 660417693758156800, "date": "2015-10-31", "time": "19:27:02", "tweet": "Black Lives Matter protesters totally disrupt Hillary Clinton event. She looked lost. This is not what we need with ISIS, CHINA, RUSSIA etc."}
{"id": 660259153554862080, "date": "2015-10-31", "time": "08:57:03", "tweet": "\"@teed_chris: DonaldTrump,NAME ONE CANDIDATE WHO CAN MAKE DEALS WITH CHINA ! IF WE DONT BRING JOBS BACK! WERE DEAD  pic.twitter.com/u4qcXps6QB\""}
{"id": 653961401363468288, "date": "2015-10-13", "time": "23:52:02", "tweet": "How can Jeb Bush expect to deal with China, Russia + Iran if he gets caught doing a “plant” during my speech yesterday in NH?"}
{"id": 653897939933364224, "date": "2015-10-13", "time": "19:39:52", "tweet": "The arrogant young woman who questioned me in such a nasty fashion at No Labels yesterday was a Jeb staffer! HOW CAN HE BEAT RUSSIA & CHINA?"}
{"id": 641451073631338496, "date": "2015-09-09", "time": "11:20:28", "tweet": "\"@americanhowl: While @realDonaldTrump rallies #NoIranDeal tomorrow, @JebBush will call China to ask for donations   http://fortune.com/2015/09/08/bush-asia-fundraising/ …\""}
{"id": 635829918199324672, "date": "2015-08-24", "time": "23:04:00", "tweet": "Depression- be careful of China!  https://instagram.com/p/6xT08ZGhQc/ "}
{"id": 635809588567257088, "date": "2015-08-24", "time": "21:43:13", "tweet": "Markets are crashing - all caused by poor planning and allowing China and Asia to dictate the agenda. This could get very messy! Vote Trump."}
{"id": 635806464595116032, "date": "2015-08-24", "time": "21:30:48", "tweet": "As I have long stated, we are so tied in with China and Asia that their markets are now taking the U.S. market down. Get smart U.S.A."}
{"id": 631516221003927553, "date": "2015-08-13", "time": "01:22:54", "tweet": "\"@DavidHerjavec @realDonaldTrump completely right on China...just watch the news #GoTrump\""}
{"id": 625125795195920384, "date": "2015-07-26", "time": "10:09:38", "tweet": "\"@Foshay504: @greta DonaldTrump-Love him! It's time to run America like a business. We've given all our wealth to China n Mexico!! No more!"}
{"id": 612424168055939072, "date": "2015-06-21", "time": "08:57:54", "tweet": "Who would you rather have negotiating for the U.S. against Putin, Iran, China, etc., Donald Trump or Hillary? Is there even a little doubt?"}
{"id": 611864962382843904, "date": "2015-06-19", "time": "19:55:49", "tweet": "\"@AndyBran: @JoeNBC  Mr. Trump nailed it! Wow: After Doubts, Economists Find China Kills U.S. Factory Jobs -  http://conservativeread.com/wow-after-doubts-economists-find-china-kills-u-s-factory-jobs/ …”\""}
{"id": 606915921958060033, "date": "2015-06-06", "time": "04:10:06", "tweet": "China just hacked our federal government & stole gov. workers’ information. Why do our leaders let China get away with this?! No respect."}
{"id": 604962578171850753, "date": "2015-05-31", "time": "18:48:12", "tweet": "\"@jsilva74366572:  @nicksibrodi vote for Trump unless u want to keep getting fucked by isis, china, lobbyists and everyone else\""}
{"id": 603421658142113792, "date": "2015-05-27", "time": "12:45:08", "tweet": "\"@2014_vince: @njm4250 That means he can get the better of china..china control bush.obama.....Trump uses,controls china.never loses\""}
{"id": 601264400390062080, "date": "2015-05-21", "time": "13:52:58", "tweet": "\"@champforrest: @megynkelly  Bringing jobs back from China & Asia is a winning issue. He'll capture the Reagan Democrats. Hope he runs.\""}
{"id": 601065955855376384, "date": "2015-05-21", "time": "00:44:25", "tweet": "\"@iamgavinjame To make America great again we must #THINKBIG & understand that it's #TimeToGetTough on China! @realDonaldTrump will do that!"}
{"id": 600743104908496896, "date": "2015-05-20", "time": "03:21:32", "tweet": "TPP does not stop Japan’s currency manipulation & China has a backdoor to join. It must be stopped. We need to protect the American worker!"}
{"id": 600732734668025856, "date": "2015-05-20", "time": "02:40:19", "tweet": "Our debt finances China’s military. It's time to get tough – we hold all the cards. Let’s Make America Great Again!  https://www.donaldjtrump.com/ "}
{"id": 597992288535650304, "date": "2015-05-12", "time": "13:10:46", "tweet": "\"@cerrabella: @realDonaldTrump China to build military base in Africa next to critical choke oil transport- zerohedge  http://www.zerohedge.com/news/2015-05-10/china-open-military-base-horn-africa-next-critical-oil-transit-choke-point …"}
{"id": 596305482756788225, "date": "2015-05-07", "time": "21:28:00", "tweet": "\"@jrondatampier: If Obama isnt able to solve Baltimore´s issue, no chance to solve China´s & OPEC´s abuses. The World asks for leadership!"}
{"id": 593037926369464320, "date": "2015-04-28", "time": "21:03:54", "tweet": "The best social program, by far, is a JOB! Our jobs are being taken away from us by China and many other countries - incompetent leader."}
{"id": 591985150575190016, "date": "2015-04-25", "time": "23:20:33", "tweet": ".@PennyPritzker Really important to cover currency manipulation in trade agreements - that's where China and others are beating us. Best!"}
{"id": 591904699181309953, "date": "2015-04-25", "time": "18:00:51", "tweet": "How do you take care of our people if you don't make anything? We don't make anything. We are rapidly losing our manufacturing to China etc."}
{"id": 591227205759410177, "date": "2015-04-23", "time": "21:08:44", "tweet": "\"@rightjj: @realDonaldTrump: I've to say that you're making sense in a lot of things especially on China! Nobody else dares to raise it!\""}
{"id": 591223022457073664, "date": "2015-04-23", "time": "20:52:07", "tweet": "\"@lorry_bennetti: @realDonaldTrump China has been laughing at the W🌏RLD for a long time & will continue to do so!\""}
{"id": 590983873451978753, "date": "2015-04-23", "time": "05:01:50", "tweet": "China has a backdoor into the Trans-Pacific Partnership. This deal does not address currency manipulation. China is laughing at us."}
{"id": 589616766701146112, "date": "2015-04-19", "time": "10:29:26", "tweet": "\"@stephenfhayes: Trump: \"I have made a fortune against China.I know all of the killers on Wall Street.\" Trump v China? \"China has no chance!"}
{"id": 583153063806046208, "date": "2015-04-01", "time": "14:24:59", "tweet": "\"@Josh_Millard16: I'm loving everything DonaldTrump has been saying about the Iranian Nuclear deal, China, Mexico, and the border.Please run"}
{"id": 582639618350288896, "date": "2015-03-31", "time": "04:24:44", "tweet": "My @WMUR9 Commitment 2016 Conversation with @JoshMcElveen discussing leadership, China, healthcare & veterans  http://www.wmur.com/politics/conversation-with-the-candidate/commitment-2016-conversation-with-the-candidate-donald-trump/32051086?absolute=true&utm_source=dlvr.it&utm_medium=twitter&utm_campaign=wmur9 …"}
{"id": 580221208639197184, "date": "2015-03-24", "time": "12:14:50", "tweet": "\"@raymeem: @megynkelly @realDonaldTrump I see Donald is the only guy who makes sense on economic reality.He sees naïveté of America vs China"}
{"id": 545499365222019073, "date": "2014-12-18", "time": "16:42:38", "tweet": "\"@Teeroyd: @realDonaldTrump you told America what needs to happen with china, trade, jobs ect..so you need to run - 2016!"}
{"id": 543701468008960001, "date": "2014-12-13", "time": "17:38:26", "tweet": "\"@JackWitty: I don't want a party as My President, I want a decisive,confident Leader. @realDonaldTrump will \"fire\" China. Give US a spark\""}
{"id": 543141071820439552, "date": "2014-12-12", "time": "04:31:37", "tweet": "\"@redvetttes: @realDonaldTrump @itsRyanHilton if he tells China where to go ,He has my vote\""}
{"id": 537155665635344385, "date": "2014-11-25", "time": "16:07:45", "tweet": "As China and the rest of the World continue to rip off the U.S. economically, they laugh at us and our president over the riots in Ferguson!"}
{"id": 534458281901948930, "date": "2014-11-18", "time": "05:29:18", "tweet": "Obama’s China ‘climate’ deal binds America with language of ‘will’ curb emissions now while China only ‘intends’ to curb in 2030. Bad deal!"}
{"id": 532236056893333505, "date": "2014-11-12", "time": "02:18:59", "tweet": "My @greta int. discussing $25,000 gift to USMC Tahmooressi, Obama’s trip to China & the 2014 election results  http://www.foxnews.com/on-air/on-the-record/2014/11/11/trump-china-rips-us-obamas-trip-travesty …"}
{"id": 531372695917957120, "date": "2014-11-09", "time": "17:08:17", "tweet": "Remember, we don't get any oil from Iraq, China gets whatever ISIS hasn't already taken. So why isn't China sending the troops? Too smart!"}
{"id": 527890202673840128, "date": "2014-10-31", "time": "02:30:06", "tweet": "Chinese oil trader just bought “record number” of Mideast crude  http://www.bloomberg.com/news/2014-10-28/chinese-oil-trader-buys-record-number-of-mideast-cargoes.html#disqus_thread?hootPostID=69bba9a379db6263f0005fb54c720cff … China gains while we fight ISIS. What are we doing?"}
{"id": 521876267193602048, "date": "2014-10-14", "time": "12:12:52", "tweet": "\"@InTheElections: @realDonaldTrump China wouldn't be laughing at President Trump.\" So true!"}
{"id": 521720136722808832, "date": "2014-10-14", "time": "01:52:28", "tweet": "#TrumpVlog China is laughing at U.S.  http://instagram.com/p/uGgpC4Ghd-/ "}
{"id": 521651877352857600, "date": "2014-10-13", "time": "21:21:14", "tweet": "Wow, China exports rise 15% in September. They are laughing at USA!"}
{"id": 520375475227471872, "date": "2014-10-10", "time": "08:49:16", "tweet": "China is ripping wealth out Africa and yet, as usual, refuses to put anything back to help with Ebola. \"Let the stupid Americans do it!\" SAD"}
{"id": 520201280120455168, "date": "2014-10-09", "time": "21:17:04", "tweet": "Right now 4000 U.S. troops are stupidly heading to West Africa to help fight Ebola.No help from China, Russia or wealthy African oil nations"}
{"id": 520173199536173058, "date": "2014-10-09", "time": "19:25:29", "tweet": "In a little reported event, China has just overtaken the United States as the NUMBER ONE World economic power! Great going Washington!"}
{"id": 519957697530044417, "date": "2014-10-09", "time": "05:09:10", "tweet": "China has just overtaken us as the world’s largest economy. We are busy wasting $'s while China builds airports & skyscrapers."}
{"id": 519824543377268737, "date": "2014-10-08", "time": "20:20:03", "tweet": "Obama is looking like an incompetent fool in the handling of the war against.ISIS! Why isn't China and Russia helping - they gain so much!"}
{"id": 513021653102919682, "date": "2014-09-20", "time": "01:47:48", "tweet": "China's the leading exporter of Iraqi oil yet they won’t lift a finger against ISIS. Why should we do the heavy lifting for China’s gain?"}
{"id": 507992304737865729, "date": "2014-09-06", "time": "04:42:58", "tweet": "China is going to complete 59 new theme parks by 2020, over $23B in expansion. That would take over 100 years in our country."}
{"id": 507584209796730880, "date": "2014-09-05", "time": "01:41:20", "tweet": "China continues to be on the move both technologically and militarily. Obama is sitting by and watching."}
{"id": 475634580620197893, "date": "2014-06-08", "time": "21:44:55", "tweet": "The same \"brilliant\" negotiators that gave up five Taliban leaders for one traitor  are now making trade deals with China & others.No chance"}
{"id": 475599057138638848, "date": "2014-06-08", "time": "19:23:46", "tweet": "By the end of this year China will be the number one economic power on earth and the U.S. will owe 20 trillion dollars, much of it to China!"}
{"id": 474213293717200897, "date": "2014-06-04", "time": "23:37:14", "tweet": "US trade deficit hit $64B+ in April, 2 yr record high  http://1.usa.gov/1iVjQDC  We must do better. China is ripping us. Bring the jobs home!"}
{"id": 468628780991258625, "date": "2014-05-20", "time": "13:46:22", "tweet": "Remember, China is not a friend of the United States!"}
{"id": 468628444192845825, "date": "2014-05-20", "time": "13:45:02", "tweet": "A classic - China just signs massive oil and gas deal with Russia giving Russia plenty of ammo to continue laughing in U.S. face."}
{"id": 462219439052980224, "date": "2014-05-02", "time": "21:17:56", "tweet": "China will now pass our economy this year, way ahead of projections. Pres. Obama – China’s greatest asset!"}
{"id": 459817313408417792, "date": "2014-04-26", "time": "06:12:45", "tweet": "Isn't it ironic that China is going all in nuclear for energy while at the same time making wind turbines for others. @alexsalmond"}
{"id": 458706132035309568, "date": "2014-04-23", "time": "04:37:18", "tweet": "China is closing a massive oil deal w/ Russia, taking advantage of the Ukraine conflict  http://bit.ly/1hcdNwN  Smart, unlike our leaders."}
{"id": 458529115197681664, "date": "2014-04-22", "time": "16:53:54", "tweet": "Once the tragic mistake of going into Iraq was made, we should have at least taken the oil (or at least some of it). Now Iran & China get it"}
{"id": 452508840752607232, "date": "2014-04-06", "time": "02:11:29", "tweet": "For China, of all nations, to search the massive Indian Ocean and pick up the ping from the black box of flight 370 sounds a bit far fetched"}
{"id": 448827557241421824, "date": "2014-03-26", "time": "22:23:23", "tweet": "If you’ve looked over the years,I’ve been right on virtually every issue from Iraq (not going in but if so taking the oil) to jobs to China"}
{"id": 446794542839500802, "date": "2014-03-21", "time": "07:44:54", "tweet": "We're spending a fortune looking for the lost plane with mostly Chinese passengers, and that's OK-but how much are Russia & China spending?"}
{"id": 439426797395279872, "date": "2014-02-28", "time": "23:48:07", "tweet": "China has just intervened to lower the yuan- in other words, they will continue to screw the U.S.!"}
{"id": 437201751075463168, "date": "2014-02-22", "time": "20:26:34", "tweet": "\"@cstevechristyjr: @realDonaldTrump the Country needs a business man in charge that is not afraid to call out China. DT for P!\"  True!"}
{"id": 425370123621236736, "date": "2014-01-21", "time": "04:51:55", "tweet": "Hope & Change! China now controls a record number of our debt   http://bloom.bg/1e6Kppd "}
{"id": 412162068989874176, "date": "2013-12-15", "time": "18:07:49", "tweet": "We should be focusing on beautiful, clean air & not on wasteful & very expensive GLOBAL WARMING bullshit! China & others are hurting our air"}
{"id": 408595321384476673, "date": "2013-12-05", "time": "21:54:50", "tweet": "The problem w/ the concept of \"global warming\" is that the U.S. is spending a fortune on \"fixing it\" while China & others do nothing!"}
{"id": 399736198643847168, "date": "2013-11-11", "time": "11:11:51", "tweet": "If we could force Russia, China and other competitors to use ObamaCare, we would be able to instantly destroy their great economic success!"}
{"id": 395653865896308737, "date": "2013-10-31", "time": "04:50:07", "tweet": "China just called. They want to lend Obama another $1B for the ObamaCare web site."}
{"id": 394928994899869696, "date": "2013-10-29", "time": "04:49:44", "tweet": "Iraq is being ravaged by Al Qaeda. Country in utter chaos & all oil is going to Iran & China  http://on.wsj.com/HmCrMU  Terrible mistake!"}
{"id": 391289680010158080, "date": "2013-10-19", "time": "03:48:24", "tweet": "Wow, China's growth accelerated 7.8% in third quarter.  If the U.S. had half that number we would be the talk of the World - need leadership"}
{"id": 388759344772182016, "date": "2013-10-12", "time": "04:13:45", "tweet": "Many countries including allies already see China as world superpower  http://bit.ly/16Vr2iU  We have greatest military, yet no respect"}
{"id": 387677061587804160, "date": "2013-10-09", "time": "04:33:08", "tweet": "The new reality, China and Japan are warning us not to default  http://cnb.cx/1a7HffU   Reckless government spending has made us weak."}
{"id": 378236334273331201, "date": "2013-09-13", "time": "03:19:04", "tweet": "China, Russia and Iran are laughing at us. We have weak leaders who are threatening our national security. Dangerous times."}
{"id": 375971865996832768, "date": "2013-09-06", "time": "21:20:52", "tweet": "I am not angry at Russia (or China) because their leaders are far smarter than ours. We need real leadership, and fast,before it is too late"}
{"id": 374967222512267264, "date": "2013-09-04", "time": "02:48:47", "tweet": "China, OPEC and Russia laugh at us. But now thanks to Obama so does Syria. Very sad!"}
{"id": 373742774597992448, "date": "2013-08-31", "time": "17:43:15", "tweet": "China is already preparing to benefit economically from this mess. They will pick up the pieces and make yet another fortune-& laugh at us!"}
{"id": 369926270814924801, "date": "2013-08-21", "time": "04:57:50", "tweet": "I will be doing Greta Van Susteren @gretawire tonight at 10 PM on Fox News, talking about China & Mitt's failed campaign team."}
{"id": 362990986026172416, "date": "2013-08-02", "time": "01:39:29", "tweet": "My @SteveDeaceShow int. on China, the economy and my upcoming keynote at @theFAMiLYLEADER Leadership Summit http://bit.ly/16mcXri "}
{"id": 361666174951497729, "date": "2013-07-29", "time": "09:55:10", "tweet": "\"@lazyj70: @realDonaldTrump @Maathewdavis beating China, and I'd just like to see someone that's in it for the good of the USA.  Great!"}
{"id": 361663135146442752, "date": "2013-07-29", "time": "09:43:05", "tweet": "\"@Maathewdavis: @realDonaldTrump if Mr. Trump runs for president, America will get back to beating china! Go trump!!\""}
{"id": 360827239169929216, "date": "2013-07-27", "time": "02:21:32", "tweet": "The new reality – China’s demand for oil now controls the market  http://bit.ly/13dTKD1   And OPEC gets away with ripping us off at $105!"}
{"id": 359734388956741632, "date": "2013-07-24", "time": "01:58:56", "tweet": "ginrnnr2                     \"@realDonaldTrump ...is China economy in a \"bubble\"?\"  Only if we want it to be!"}
{"id": 358268507642798081, "date": "2013-07-20", "time": "00:54:03", "tweet": "In @oreillyfactor’s No Spin Zone re: ObamaCare causing unemployment, negotiating with China & my $5M court win  http://fxn.ws/1bNTKRH "}
{"id": 356852537749553153, "date": "2013-07-16", "time": "03:07:29", "tweet": "Ready to get mad?! We are sending foreign aid to China, our greatest threat  http://atfp.co/13dJ4br  We are financing our enemy."}
{"id": 356305203433193472, "date": "2013-07-14", "time": "14:52:34", "tweet": "\"@SScottlilly80: @realDonaldTrump Run for president we need someone to stand up china and Russia. They laugh at us now.\" They do laugh!"}
{"id": 355119266317615105, "date": "2013-07-11", "time": "08:20:05", "tweet": "Snowden has given serious information to China and Russia-anyone who thinks otherwise is a dope! He is a traitor who fled-he knew the crime!"}
{"id": 350599370120511488, "date": "2013-06-28", "time": "20:59:38", "tweet": "\"@TeaPartyHub: Infuriating that our government buys our flags from China! Such disrespect!  http://dailycaller.com/2013/06/23/lawmakers-want-to-stop-government-from-buying-usa-flags-from-china/ … @WashingtonDCTea"}
{"id": 349973845228269569, "date": "2013-06-27", "time": "03:34:01", "tweet": "China loved Obama’s climate change speech yesterday. They laughed! It hastens their takeover of us as the leading world economy."}
{"id": 349696756155564034, "date": "2013-06-26", "time": "09:12:58", "tweet": "\"@Michelle823: @realDonaldTrump made in China! No way! Lead the manufacturing back to USA !\" I am working hard to do so!"}
{"id": 349248454045859841, "date": "2013-06-25", "time": "03:31:34", "tweet": "Our debt is about to top $17T. ObamaCare and China (& others) are killing American business."}
{"id": 349231954396332032, "date": "2013-06-25", "time": "02:26:01", "tweet": "We are being embarrassed by Russia and China on Snowden (and much more) yet Obama is talking about global warming on Tuesday."}
{"id": 346996400963338240, "date": "2013-06-18", "time": "22:22:43", "tweet": "Snowden is doing great damage to our relations with other countries and U.S.prestige. China is laughing at us as he continues illegal action"}
{"id": 346993964483743746, "date": "2013-06-18", "time": "22:13:02", "tweet": "Snowden is sitting in China and taunting the U.S. He is mocking us as a Country. Great time to place a tax on China trade if not turned over"}
{"id": 345619254042832897, "date": "2013-06-15", "time": "03:10:26", "tweet": "My @piersmorgan interview on Snowden the traitor, national security and China hacking us  http://bit.ly/12Le8BT "}
{"id": 344988801850015744, "date": "2013-06-13", "time": "09:25:14", "tweet": "Lightweight @DannyZuker is too stupid to see that China (and others) is destroying the U.S. economically and our leaders are helpless! SAD."}
{"id": 344843316917059584, "date": "2013-06-12", "time": "23:47:08", "tweet": "I've been warning about China since as early as the 80’s. No one wanted to listen. Now our country is in real trouble. #TimetoGetTough"}
{"id": 344427911006281729, "date": "2013-06-11", "time": "20:16:27", "tweet": "\"@tabloidhack: 2016 platform? China must be stopped from treating the U.S. like a chump, says @realDonaldTrump.  http://www.washingtontimes.com/news/2013/jun/10/miller-donald-trump-says-country-going-hell-handba/ …\""}
{"id": 344158484109070337, "date": "2013-06-11", "time": "02:25:51", "tweet": "China is openly sailing warships in our waters & arming countries in our hemisphere including Mexico  http://bit.ly/ZzaerM  Ally?"}
{"id": 344142489562804224, "date": "2013-06-11", "time": "01:22:18", "tweet": ".@foxandfriends int. on gov. collecting data, whistle blower hiding in China & no bikinis in Miss World pageant  http://bit.ly/11uBrcK "}
{"id": 341947431757443073, "date": "2013-06-04", "time": "23:59:55", "tweet": "Via @Newsmax_Media by Courtney Coren: \"Trump: China Gets Iraq Oil; US Gets Nothing\"  http://bit.ly/18QPD7v "}
{"id": 341643448362881024, "date": "2013-06-04", "time": "03:52:00", "tweet": "Pres. Obama is meeting with China’s Pres. this week  http://politi.co/15ygS2S  He will get zero deliverables. China laughs at us."}
{"id": 340140612529573888, "date": "2013-05-31", "time": "00:20:16", "tweet": "China has done great under Obama. Increased private US holdings by 500%. Hacks our military & R&D. Robs us blind daily.#timetogettough"}
{"id": 340128201273667584, "date": "2013-05-30", "time": "23:30:57", "tweet": "My @TeamCavuto interview re: 2016, the need for leadership in our country, Syria & China hacking our military  http://fxn.ws/11COWMd "}
{"id": 339838035195752448, "date": "2013-05-30", "time": "04:17:56", "tweet": "Military has announced that China has successfully hacked our advanced weapon designs. China is our enemy.Should we offset this on our debt?"}
{"id": 327845703919484928, "date": "2013-04-27", "time": "02:04:41", "tweet": "Just as I predicted, Iraq is deteriorating into utter chaos  http://bit.ly/11ZsNT7   The war was a waste. China is taking all the oil."}
{"id": 327504327335886848, "date": "2013-04-26", "time": "03:28:11", "tweet": "Dangerous. While Obama is cutting down our military, China has announced plans to build more aircraft carriers  http://bloom.bg/12HbxG9 "}
{"id": 326430912881516545, "date": "2013-04-23", "time": "04:22:49", "tweet": "Our enemy China is illegally buying oil from our enemy Iran  http://bit.ly/10hTQii  China loves it!"}
{"id": 324584451495571456, "date": "2013-04-18", "time": "02:05:38", "tweet": "The Chinese must still be laughing at Kerry’s trip to China.  He got nothing, gave them everything and promised even more."}
{"id": 323215207126163458, "date": "2013-04-14", "time": "07:24:45", "tweet": "China will extract much from Secretary Kerry and the U:S. in order for them to help us with the North Korea problem-don't let this happen!"}
{"id": 323188504328806400, "date": "2013-04-14", "time": "05:38:38", "tweet": "\"@CoolCanuckChick: @realDonaldTrump I thought China was good with the U.S.?\"  Only if you want no country left!"}
{"id": 322921029708165120, "date": "2013-04-13", "time": "11:55:47", "tweet": "Ridiculous that they gave the 14 year old golfer from China a one stroke penalty for slow play at The Masters(see, I can stick up for China)"}
{"id": 322918034585026560, "date": "2013-04-13", "time": "11:43:53", "tweet": "\"@HogmanjemJack: @realDonaldTrump After Obama bailed out GM for $80 Billion, 7 out of 10 GM cars made in China!\""}
{"id": 322820301824081920, "date": "2013-04-13", "time": "05:15:32", "tweet": "@bakerjb19 China will only rule if we let them--or are stupid."}
{"id": 322792909780963328, "date": "2013-04-13", "time": "03:26:41", "tweet": "China controls North Korea. So now besides cyber hacking us all day, they are using the Norks to taunt us.  China is a major threat."}
{"id": 321716462966415362, "date": "2013-04-10", "time": "04:09:16", "tweet": "It’s Tuesday, how much has China stolen from us today through cyber espionage?"}
{"id": 321350017149460481, "date": "2013-04-09", "time": "03:53:09", "tweet": "The new reality. ‘China Daily’ is sold in street newspaper vending machines across DC. Why not? They own the place."}
{"id": 320674283372302336, "date": "2013-04-07", "time": "07:08:01", "tweet": "China is pushing North Korea!"}
{"id": 320169829959090177, "date": "2013-04-05", "time": "21:43:30", "tweet": "\"@trackdonny: @realDonaldTrump . Thanks for spreading the truth about China and all Donald trump. You rock brother. Donny stjohn Sag. Actor\""}
{"id": 320161090732433409, "date": "2013-04-05", "time": "21:08:46", "tweet": "North Korea can't survive, or even eat, without the help of China. China could solve this problem with one phone call-they love taunting us!"}
{"id": 319526989201555457, "date": "2013-04-04", "time": "03:09:05", "tweet": "The purpose of China’s massive military buildup on the Nork’s border is to intimidate us. China attacked us during the Korean War."}
{"id": 319436402788007936, "date": "2013-04-03", "time": "21:09:07", "tweet": "We should look to China where big time pollution takes place as they manufacture inefficient and costly wind turbines for Scotland!"}
{"id": 319187653784371201, "date": "2013-04-03", "time": "04:40:41", "tweet": "I think it was terrible that Tim Cook of Apple apologized to China. What the hell is he apologizing for? Steve Jobs wouldn’t."}
{"id": 319174786548908032, "date": "2013-04-03", "time": "03:49:33", "tweet": "The Yuan hit another record high against the Dollar. China is laughing at our expense."}
{"id": 319174411422928896, "date": "2013-04-03", "time": "03:48:04", "tweet": "China has control over North Korea!"}
{"id": 318826970139983872, "date": "2013-04-02", "time": "04:47:27", "tweet": "Sacrificing our nation’s bravest for  ungrateful Iraqis = great for China. China is taking majority of the oil  http://bit.ly/XIvcAw "}
{"id": 318122658745159680, "date": "2013-03-31", "time": "06:08:46", "tweet": "No, I'm saying that the World is paying the price for China's pollution while they make a fortune with their dirty factories! Very sad."}
{"id": 318117211665469441, "date": "2013-03-31", "time": "05:47:08", "tweet": "Major article in New York Times today discusses the cost of environmental damage in China and how it is RAPIDLY GROWNG! Rest of World pays."}
{"id": 318113046822273027, "date": "2013-03-31", "time": "05:30:35", "tweet": "China is the biggest environmental polluter in the World, by far. They do nothing to clean up their factories and laugh at our stupidity!"}
{"id": 318085997000806400, "date": "2013-03-31", "time": "03:43:06", "tweet": "We have tremendous economic power over China if our leaders knew how to use it, which they don't! China's economy would collapse without us."}
{"id": 317962835974053888, "date": "2013-03-30", "time": "19:33:42", "tweet": "North Korea is reliant on China. China could solve this problem easily if they wanted to but they have no respect for our leaders."}
{"id": 317342730466516993, "date": "2013-03-29", "time": "02:29:37", "tweet": "Terrible economic numbers released today. US GDP only grew 0.4% during Oct-Dec 2012 quarter  http://apne.ws/14ygiV4  Great news for China."}
{"id": 316293536221908992, "date": "2013-03-26", "time": "05:00:30", "tweet": "After decades of our leaders allowing China to steal our jobs & R&D, the Chinese will ‘overtake America’ in 2016 ..."}
{"id": 316293513539108864, "date": "2013-03-26", "time": "05:00:24", "tweet": "...Re: China--I told you that a long time ago.  http://bit.ly/106YoCL "}
{"id": 316285942333841409, "date": "2013-03-26", "time": "04:30:19", "tweet": "China’s top academics are working w/ PLA in cyber-espionage of our state secrets & R&D  http://reut.rs/YsY59Y  They are laughing at us!"}
{"id": 316282709154619392, "date": "2013-03-26", "time": "04:17:28", "tweet": "Obama has now become the weakest POTUS against China, yuan just hit record high against dollar  http://on.wsj.com/YsXxRk   Very sad!"}
{"id": 310114273370198016, "date": "2013-03-09", "time": "03:46:19", "tweet": "Surprise – China has spies throughout NASA stealing our R&D  http://bit.ly/16ed0Fq  When will we ever make them pay for espionage?"}
{"id": 308670794135924736, "date": "2013-03-05", "time": "04:10:26", "tweet": "China has announced it is “fully prepared” for a currency war  http://f24.my/WDK1Us  Outrageous - they have no fear of our leaders."}
{"id": 307245049966653441, "date": "2013-03-01", "time": "05:45:02", "tweet": "As China is built on corporate espionage, currency manipulation & cheap labor, its economy is a ticking time bomb  http://bit.ly/13pFxIz "}
{"id": 306868031676633089, "date": "2013-02-28", "time": "04:46:54", "tweet": "There was a major diplomatic breakthrough yesterday w/the White House, Iran & China. All celebrated Chuck Hagel being voted in as SOD."}
{"id": 306235882585870336, "date": "2013-02-26", "time": "10:54:58", "tweet": "The United States better address China's exchange rate before they steal our country and it is too late! China is laughing at us."}
{"id": 306150062474539008, "date": "2013-02-26", "time": "05:13:57", "tweet": "China is buying gas fields in Texas  http://bit.ly/lW3bmb  & stealing our corporate secrets..."}
{"id": 306123310926815232, "date": "2013-02-26", "time": "03:27:39", "tweet": "My @foxandfriends re: the sequestration, failure of leadership in DC, China playing us & taking over in 2016  http://bit.ly/13INJPo "}
{"id": 304690887248707584, "date": "2013-02-22", "time": "04:35:43", "tweet": "China is not our friend. They are not our ally. They want to overtake us, and if we don’t get smart and tough soon, they will."}
{"id": 303981093432991745, "date": "2013-02-20", "time": "05:35:15", "tweet": "Now China is helping Iran smuggle nuclear parts  http://bit.ly/XWaQo4  . China is not an ally but our country's greatest threat & rival."}
{"id": 299629835213500416, "date": "2013-02-08", "time": "05:24:54", "tweet": "China keeps manipulating its currency at our financial expense.  Why do our leaders continually let China run all over us?"}
{"id": 299242390244438016, "date": "2013-02-07", "time": "03:45:20", "tweet": "Just as I predicted, immigration reform will increase the cost of ObamaCare over $300B  http://bit.ly/XVBQ4O  More money borrowed from China."}
{"id": 298546046081048577, "date": "2013-02-05", "time": "05:38:18", "tweet": "China is buying our shale and gas fields  http://onforb.es/VE8w8E  & Obama still won’t approve Keystone  http://reut.rs/VE8Ioo  Pathetic!"}
{"id": 298545324467830784, "date": "2013-02-05", "time": "05:35:26", "tweet": "China is about to acquire 82,800 net acres of a Texas shale oil and gas field  http://onforb.es/VE8w8E   What are we doing!"}
{"id": 296731670021799936, "date": "2013-01-31", "time": "05:28:37", "tweet": "Obama's speech in Las Vegas yesterday cost the taxpayer $520 per word and over $1.6M   http://bit.ly/VnDM6t   More money borrowed from China."}
{"id": 296327015588569088, "date": "2013-01-30", "time": "02:40:40", "tweet": "The new reality.  China’s economy ‘underpins’ global demand  http://reut.rs/1186nz8  Our leaders just watched as China took full control."}
{"id": 294538300692238336, "date": "2013-01-25", "time": "04:12:57", "tweet": "...Terrible for the economy and a job killer. China is laughing at us!"}
{"id": 294164901662953473, "date": "2013-01-24", "time": "03:29:12", "tweet": "In 2010 alone our trade deficit with China cost over 566,000 jobs  http://bit.ly/XzIFJR   This is unsustainable for the American worker."}
{"id": 291296736457146368, "date": "2013-01-16", "time": "05:32:08", "tweet": "China watched Obama’s press conference yesterday salivating.  We will be borrowing trillions more from them."}
{"id": 291229591626973187, "date": "2013-01-16", "time": "01:05:20", "tweet": "We were led to believe that Jeep would manufacture in U.S. and sell to China—like China does to us."}
{"id": 291223214267441153, "date": "2013-01-16", "time": "00:39:59", "tweet": "Unlike U.S., China taxes things made in the U.S. and sold in China. China demands plants, we don’t. Stupid!"}
{"id": 291214378987057152, "date": "2013-01-16", "time": "00:04:53", "tweet": "From Bloomberg: “Chrysler’s Jeep expects China production agreement soon.”  I told you so."}
{"id": 289114333500289026, "date": "2013-01-10", "time": "05:00:03", "tweet": "Hagel has been endorsed by China  http://bit.ly/UFOaI8  & Iran  http://huff.to/V99uI7   for SOD.  Welcome to Obama's second term!"}
{"id": 288390473868013568, "date": "2013-01-08", "time": "05:03:41", "tweet": "Trade with China has killed over 29% of US manufacturing jobs in the US  http://wapo.st/13dNkpL  China is robbing us blind!"}
{"id": 281864496912400386, "date": "2012-12-21", "time": "04:51:47", "tweet": "China is robbing us blind in trade deficits and stealing our jobs, yet our leaders are claiming 'progress'  http://reut.rs/Ub64mP  SAD!"}
{"id": 278956599786213376, "date": "2012-12-13", "time": "04:16:50", "tweet": "We can’t even stop the Norks from blasting a missile.  China is laughing at us.  It is really sad."}
{"id": 278556002893303809, "date": "2012-12-12", "time": "01:45:01", "tweet": "China is buying so many of our companies-- it’s really getting bad."}
{"id": 278239034478833664, "date": "2012-12-11", "time": "04:45:29", "tweet": "The government is borrowing 46 cents on every dollar it spends  http://bit.ly/11U1LzB   Dangerous for us but great news for China."}
{"id": 278235827933433857, "date": "2012-12-11", "time": "04:32:45", "tweet": "The Chinese are smart.  They bought up over $7B in US housing last year  http://fxn.ws/TPsOcw   U.S. is busy making China even richer."}
{"id": 278235379344220161, "date": "2012-12-11", "time": "04:30:58", "tweet": "China is about to acquire a unit of AIG, which we bailed out, for $5.5B  http://reut.rs/TPsoD7  China is making great deals on our backs."}
{"id": 278203787263483904, "date": "2012-12-11", "time": "02:25:26", "tweet": "My @foxandfriends interview discussing the Ground Zero Mosque, fiscal cliff, China buying AIG & Anna Wintour  http://bit.ly/TPorhE "}
{"id": 275715671499870208, "date": "2012-12-04", "time": "05:38:33", "tweet": "Philadelphia’s Mayor Michael Nutter is in China to drum up business for his struggling city.Our politicians are controlled by the Chinese."}
{"id": 273876477756465152, "date": "2012-11-29", "time": "03:50:15", "tweet": "Treasury has refused to name China a currency manipulator even though the yuan “remains significantly undervalued”  http://bloom.bg/SdU4iL "}
{"id": 273540096769269760, "date": "2012-11-28", "time": "05:33:35", "tweet": "China just landed a jet on an aircraft carrier stolen from a U.S. design.  http://bit.ly/WW5Dj3  We should offset the thievery from our debt.."}
{"id": 273518170554388480, "date": "2012-11-28", "time": "04:06:28", "tweet": "Want to know why China is growing?  They can build the world’s tallest building in 90 days  http://bit.ly/NrukQC  Red tape would kill it here."}
{"id": 273170181386301440, "date": "2012-11-27", "time": "05:03:41", "tweet": "China’s increased naval exercises in the Bohai Sea are a continued threat and dangerous for the world markets."}
{"id": 271342868667449344, "date": "2012-11-22", "time": "04:02:35", "tweet": "Direct foreign investments continue to flow into China at over $100B a year  http://reut.rs/UlOdb4   That's money that could be spent here."}
{"id": 270626232612290560, "date": "2012-11-20", "time": "04:34:56", "tweet": "Must read article in @Forbes explaining the ‘transition’ in Chinese leadership:  China's Anti-Reformers Take Over  http://onforb.es/TMvanz "}
{"id": 269564335293087744, "date": "2012-11-17", "time": "06:15:20", "tweet": "Now China is trying to take over a U.S. airbase  http://bit.ly/SoxUZf   This is only the beginning. They only understand toughness!"}
{"id": 268093340736696321, "date": "2012-11-13", "time": "04:50:08", "tweet": "This past October, China’s export surplus grew to 5 month high of 11%, biggest jump in 45 months  http://reut.rs/Zfv6U3  Not good."}
{"id": 266664315522793475, "date": "2012-11-09", "time": "06:11:41", "tweet": "China is heavily investing in building its own jet engine  http://reut.rs/Sx7nJn   They will end up stealing the design from us as usual."}
{"id": 266661755520970752, "date": "2012-11-09", "time": "06:01:31", "tweet": "China's submarines will soon be carrying nukes  http://reut.rs/Sx64do   They will be sent to patrol our coasts, Obama won't do anything."}
{"id": 266661264992915457, "date": "2012-11-09", "time": "05:59:34", "tweet": "China's Communist Party has now publicly praised Obama's reelection.  They have never had it so good.  Will own America soon."}
{"id": 266290276874739712, "date": "2012-11-08", "time": "05:25:24", "tweet": "Now that the election is over, watch Chrysler ship @Jeep production to China--my prediction."}
{"id": 265908017772523520, "date": "2012-11-07", "time": "04:06:26", "tweet": "Now Chinese state run companies are taking over our coal market  http://on.wsj.com/YScqIK  China wants to deplete our resources here at home."}
{"id": 265568179978383360, "date": "2012-11-06", "time": "05:36:02", "tweet": "China is worried. The polls are trending for @MittRomney. They won’t be able to steal from us anymore."}
{"id": 265538847801212928, "date": "2012-11-06", "time": "03:39:29", "tweet": "Don't believe Chrysler (if Obama wins)--see how fast @Jeep production will be moved to China--and I'll be watching!"}
{"id": 265496271794630656, "date": "2012-11-06", "time": "00:50:18", "tweet": "We can't destroy the competitiveness of our factories in order to prepare for nonexistent global warming. China is thrilled with us!"}
{"id": 264417734320857088, "date": "2012-11-03", "time": "01:24:35", "tweet": "Looks like @RalphGilles is full of it.  @dcexaminer: \"Jeep, an Obama favorite, looks to shift production to China\"  http://bit.ly/PyHGMD "}
{"id": 264393007623716866, "date": "2012-11-02", "time": "23:46:19", "tweet": "We should not allow @Chrysler to move @Jeep jobs to China after they said they wouldn't--stay tuned!"}
{"id": 264392738118701056, "date": "2012-11-02", "time": "23:45:15", "tweet": ".@Chrysler disputes my statement--but watch Chrysler move @Jeep jobs to China after the election."}
{"id": 264022096538120192, "date": "2012-11-01", "time": "23:12:27", "tweet": "Obama is a terrible negotiator. He bails out Chrysler and now Chrysler wants to send all Jeep manufacturing to China--and will!"}
{"id": 264021186990731265, "date": "2012-11-01", "time": "23:08:50", "tweet": "Why is Obama’s auto bailout now creating jobs in China?  He is ruining American industry."}
{"id": 264009741234221058, "date": "2012-11-01", "time": "22:23:22", "tweet": "Let's continue to destroy the competitiveness of our factories & manufacturing so we can fight mythical global warming. China is so happy!"}
{"id": 263355752134098944, "date": "2012-10-31", "time": "03:04:38", "tweet": "China’s stock market rose yesterday after 4 consecutive days of losses  http://bloom.bg/V4SZxj  Their market gains the day we are hit by storm"}
{"id": 261552946565750785, "date": "2012-10-26", "time": "03:40:56", "tweet": "Yesterday Barack Obama said he wants \"wind turbines manufactured here in China\"  http://youtu.be/PuVOBSwNWbE  I don't think this was a gaffe."}
{"id": 261552582504366080, "date": "2012-10-26", "time": "03:39:29", "tweet": "China is primed to continue to rob us and steal our jobs through their exports  http://reut.rs/SwrtEe   We need @MittRomney to rein them in."}
{"id": 260790972236038144, "date": "2012-10-24", "time": "01:13:07", "tweet": "China will never go to war with us because if they won they would only take over property they already own!"}
{"id": 260475529646456832, "date": "2012-10-23", "time": "04:19:40", "tweet": "Obama planted that @nytimes story on Iran so it will be discussed in tonight's debate. He wants Libya and China off the table."}
{"id": 259027449445232640, "date": "2012-10-19", "time": "04:25:31", "tweet": "The last time I visited China I couldn't believe all the construction. You can go up with a project in a week--no red tape."}
{"id": 258394846191054849, "date": "2012-10-17", "time": "10:31:46", "tweet": "You talk tough, Mr. President, but have done nothing about China killing our jobs and economy."}
{"id": 258373635822215168, "date": "2012-10-17", "time": "09:07:29", "tweet": "Why has Obama let China and others take our jobs?"}
{"id": 257936689614450688, "date": "2012-10-16", "time": "04:11:13", "tweet": "\"Romney, Ryan Slam Obama Administration on China Currency Manipulation\"  http://abcn.ws/QnBOCF  via @ABC"}
{"id": 257936201057705984, "date": "2012-10-16", "time": "04:09:17", "tweet": "Once again Obama fails to classify China as a currency manipulator. He just helped China steal even more jobs and money from us."}
{"id": 256486209034022914, "date": "2012-10-12", "time": "04:07:32", "tweet": "It's Thursday and only 26 days until the election. How many illegal donations from China and Saudi Arabia did Obama collect today?"}
{"id": 256127187894300672, "date": "2012-10-11", "time": "04:20:54", "tweet": "Even with lower profit projections, American firms are still throwing money into China  http://reut.rs/URdA3a   Obama is killing investment."}
{"id": 255411849053499392, "date": "2012-10-09", "time": "04:58:24", "tweet": "China is taking the oil in Libya while our embassy is being attacked after we won the war for the rebels. Obama's policies suck!"}
{"id": 255370164017721344, "date": "2012-10-09", "time": "02:12:46", "tweet": "I would do same thing if I were China.  They want Obama.  http://bit.ly/SXJA4D "}
{"id": 253587791454294017, "date": "2012-10-04", "time": "04:10:15", "tweet": "Have you heard? China just told Obama to jump. Obama asked how high."}
{"id": 251409907910336512, "date": "2012-09-28", "time": "03:56:07", "tweet": "China's Financial Institutions are expanding overseas. http://bit.ly/QRPiFE  They will own everything if we don't stop them now."}
{"id": 251058933337305088, "date": "2012-09-27", "time": "04:41:28", "tweet": "China has done very well under Obama. Now they just released their first aircraft carrier."}
{"id": 251058273007063040, "date": "2012-09-27", "time": "04:38:51", "tweet": "China is filling the vacuum left by Obama at the UN on the world stage."}
{"id": 251048242723315713, "date": "2012-09-27", "time": "03:58:59", "tweet": "\"Trump: US Must Get Tougher Because China Is 'Eating Our Lunch'\"   http://bit.ly/QF6WMp  via Moneynews @Newsmax_Media"}
{"id": 250327830947303424, "date": "2012-09-25", "time": "04:16:20", "tweet": "Despite all of China's cheating, they are not doing that well--we can beat them--our country has great potential!"}
{"id": 248877100185038848, "date": "2012-09-21", "time": "04:11:39", "tweet": "Obama's Def. Sec. just said US Asia focus 'not aimed to contain China'  http://yhoo.it/RCpa0a  China is hoping that Obama is re-elected."}
{"id": 248471159803363328, "date": "2012-09-20", "time": "01:18:35", "tweet": "China has been unfairly subsidizing the export of cars & auto parts. I've been saying this for 3 years..."}
{"id": 248401743833075712, "date": "2012-09-19", "time": "20:42:45", "tweet": "Obama killed over 100k jobs by not approving Keystone XL pipeline and Canada is now selling the oil to China--very dumb!"}
{"id": 248054450042851328, "date": "2012-09-18", "time": "21:42:44", "tweet": "China is now attacking Japan's economy for leverage  http://apne.ws/StMRYE   Soon they will try the same with us. #TimeToGetTough"}
{"id": 247760969181302784, "date": "2012-09-18", "time": "02:16:32", "tweet": "After being ripped off for years, Obama finally figured out that China is taking advantage of us. He's finally listening to me."}
{"id": 246679932695097345, "date": "2012-09-15", "time": "02:40:53", "tweet": "RT @MittRomney: For nearly 4 years, Barack Obama has refused to crack down on China's cheating & American workers have paid the price."}
{"id": 245955293786279936, "date": "2012-09-13", "time": "02:41:26", "tweet": "Libya is selling its oil to China--I notice the Chinese Ambassador is very safe."}
{"id": 245875612038877184, "date": "2012-09-12", "time": "21:24:48", "tweet": "\"I've read many books about China over the decades. I know the Chinese and made a lot of money with them.\" The Art of the Deal"}
{"id": 245604297029595136, "date": "2012-09-12", "time": "03:26:42", "tweet": "China is an international pariah. They are now harassing Japan over its purchase of 3 uninhabited islands   http://bit.ly/OaiGEU "}
{"id": 243084357663858688, "date": "2012-09-05", "time": "04:33:21", "tweet": "China now 'warns' us against being involved in sea disputes  http://reut.rs/Rh4dHo "}
{"id": 241599708554997761, "date": "2012-09-01", "time": "02:13:53", "tweet": "China is now deploying drones across ocean routes used for trade  http://bit.ly/R2oCjw  They stole the technology from us."}
{"id": 241591228263702528, "date": "2012-09-01", "time": "01:40:12", "tweet": ".@BarackObama's assault on coal and gas and oil will send energy and manufacturing jobs to China.\" --@MittRomney"}
{"id": 241159091005820929, "date": "2012-08-30", "time": "21:03:02", "tweet": "It's Thursday and again I ask--how much money is China stealing from us?"}
{"id": 240896478233645057, "date": "2012-08-30", "time": "03:39:30", "tweet": "China's media is attacking @MittRomney while endorsing @BarackObama  http://bit.ly/Rk7t59   Of course. Mitt knows it's Time To Get Tough."}
{"id": 240860733926154240, "date": "2012-08-30", "time": "01:17:28", "tweet": "It's Wednesday, how much money is China stealing from us today?"}
{"id": 240816432982679552, "date": "2012-08-29", "time": "22:21:26", "tweet": "China must be worried that @MittRomney will win this November. They have never had such a pushover like @BarackObama."}
{"id": 240517969841643520, "date": "2012-08-29", "time": "02:35:27", "tweet": "Ask China if their rapidly expanding (with our money) Navy or Armed Forces are going \"green\" -- They would laugh in your face!"}
{"id": 240507883928813568, "date": "2012-08-29", "time": "01:55:22", "tweet": "My @FoxNews @TeamCavuto interview discussing the @RNC Convention, businesses making products in China and unemployment  http://bit.ly/U8sjsc "}
{"id": 240455676600659968, "date": "2012-08-28", "time": "22:27:55", "tweet": ".@FinancialTimes writes that \"@BarackObama should pray that China overtakes US\"   http://on.ft.com/U5VewZ  Don't worry, he is making it happen."}
{"id": 240092118633291776, "date": "2012-08-27", "time": "22:23:16", "tweet": ".@BarackObama sent over 100,000 jobs and Canadian oil to China all because he would not approve Keystone XL."}
{"id": 238372607806828544, "date": "2012-08-23", "time": "04:30:33", "tweet": "It's Wednesday. I wonder how much money @BarackObama borrowed from China today?"}
{"id": 237995127430320128, "date": "2012-08-22", "time": "03:30:34", "tweet": "Glad to hear that @JimTalent has put some strong anti-China referendums in the @GOP convention platform."}
{"id": 237994821841723394, "date": "2012-08-22", "time": "03:29:21", "tweet": "We have to get tough with China before they destroy us."}
{"id": 236537149070143488, "date": "2012-08-18", "time": "02:57:05", "tweet": "US government's foreign indebtedness has grown over 72% under @BarackObama. He is bleeding us dry to China."}
{"id": 236531168911167490, "date": "2012-08-18", "time": "02:33:19", "tweet": "The US government's foreign debt is at a record $5.29T  http://bit.ly/NKxE4x  China is laughing all the way to the bank."}
{"id": 236525779750625280, "date": "2012-08-18", "time": "02:11:54", "tweet": ".@MittRomney & @PaulRyanVP get what needs to be done to reign in China. @BarackObama gets kicked around by the Chinese."}
{"id": 236523864497192960, "date": "2012-08-18", "time": "02:04:18", "tweet": "Great speech on China by @PaulRyanVP yesterday where he explains why China is treating @BarackObama like a \"Doormat\" http://bit.ly/NpCa9l "}
{"id": 236161065497550848, "date": "2012-08-17", "time": "02:02:40", "tweet": "My interview with Don Imus on @77WABCradio discussing my @RNC convention surprise & @MittRomney's China policy  http://bit.ly/QFV7nv "}
{"id": 235044968828375040, "date": "2012-08-14", "time": "00:07:42", "tweet": "Today @BarackObama will borrow 40 cents on every dollar he spends from China. Just another day at the office."}
{"id": 233924399680589824, "date": "2012-08-10", "time": "21:54:57", "tweet": "China is cooking up conspiracy theories that the Olympics are rigged.   http://wapo.st/MClZtE   They don't understand why they can't cheat."}
{"id": 233648169316134912, "date": "2012-08-10", "time": "03:37:19", "tweet": "Just letting China know in advance that the USA will win the medal count in the Olympics. Even with your cheating you can't beat us."}
{"id": 233554560873021440, "date": "2012-08-09", "time": "21:25:21", "tweet": "These are facts: In 2001, the US opened its markets to China & since then more than 2 million Americans can't (cont)  http://tl.gd/iojbsh "}
{"id": 233297114715791362, "date": "2012-08-09", "time": "04:22:21", "tweet": "No surprise that China was caught cheating in the Olympics. That's the Chinese M.O. - Lie, Cheat & Steal in all international dealings."}
{"id": 233213932985253889, "date": "2012-08-08", "time": "22:51:49", "tweet": "People are finally beginning to hit China and OPEC. They never give me credit for being the first--by far--but that's okay!"}
{"id": 232913045637189632, "date": "2012-08-08", "time": "02:56:12", "tweet": "Now the world is looking to China for an economic 'lift'  http://reut.rs/MXGEbg  @BarackObama has ruined our economic hegemony."}
{"id": 232898573228990464, "date": "2012-08-08", "time": "01:58:41", "tweet": "Now China 'calls in' US diplomats to lecture them on their illegal escapades.  http://reut.rs/RawaUU   The new reality. @BarackObama is weak."}
{"id": 232566570709299200, "date": "2012-08-07", "time": "03:59:25", "tweet": "China's Olympic training program is abusive  http://bit.ly/OFJ22I  It is modern day slavery & shameful. Their (cont)  http://tl.gd/in6clo "}
{"id": 231119736732274688, "date": "2012-08-03", "time": "04:10:13", "tweet": "US interest payments on the debt have already passed $375B this year   http://1.usa.gov/AJvcp  China is laughing at us---as usual."}
{"id": 231057112099323904, "date": "2012-08-03", "time": "00:01:23", "tweet": "The U.S. manufacturing sector has suffered its greatest order losses under @BarackObama. He has stood idle while China steals our jobs."}
{"id": 230310078568345600, "date": "2012-07-31", "time": "22:32:56", "tweet": ".@BarackObama blocked Keystone. Now China is preparing a massive $1.5B oil deal with Canada.   http://reut.rs/QM1cja    A terrible deal for US!"}
{"id": 228221920963862531, "date": "2012-07-26", "time": "04:15:20", "tweet": "US Gov't is on the hook for more than a third of the world's entire debt & we wonder why China & OPEC are laughing all the way to the bank!"}
{"id": 228161234275557376, "date": "2012-07-26", "time": "00:14:11", "tweet": "This can't continue--Federal goverment's debt jumps more than $1T for 5th straight year  http://bit.ly/MEzwR1  China is buying the debt."}
{"id": 227853754404311040, "date": "2012-07-25", "time": "03:52:23", "tweet": "China's domestic economic and political problems prove how pathetic our leadership is in allowing China to rip us off  http://reut.rs/NTHC43 "}
{"id": 227834529782591490, "date": "2012-07-25", "time": "02:35:59", "tweet": "My @SquawkCNBC interview discussing housing prices, the GDP numbers, China spreading its wealth and my stock picks.  http://bit.ly/NTDOQ5 "}
{"id": 226309376212869120, "date": "2012-07-20", "time": "21:35:34", "tweet": "Bay Bridge in San Fransisco, built in China, keeps getting worse. Cost overruns are out of control --- China is having a field day with us!"}
{"id": 223830896753643520, "date": "2012-07-14", "time": "01:26:59", "tweet": ".@BarackObama finally talking tough on China. He's repeating my exact words. Where has he been for 4 years?"}
{"id": 223825720869273600, "date": "2012-07-14", "time": "01:06:24", "tweet": "America's Olympic uniforms are manufactured in China. Burn the uniforms!#U.S.OlympicCommittee"}
{"id": 220956243110543362, "date": "2012-07-06", "time": "03:04:08", "tweet": "Toledo Blade reports Ohio-made Jeep Wranglers are among the US vehicles targeted by China and subject of US complaint.  http://www.newseum.org/todaysfrontpages/hr.asp?fpVname=OH_TB&ref_pge=lst …"}
{"id": 219890977882644481, "date": "2012-07-03", "time": "04:31:09", "tweet": "China court: Apple pays $60M to settle iPad case. China is getting away with murder.  http://apne.ws/LLKFJ2 "}
{"id": 219890208487911426, "date": "2012-07-03", "time": "04:28:05", "tweet": "WRONG: A China court ordered @apple to pay $60M to a Chinese company that registered iPad before @apple http://on.wsj.com/Mn95yF "}
{"id": 218047987610427392, "date": "2012-06-28", "time": "02:27:46", "tweet": "Who's the outsourcer? @BarackObama's campaign is using a travel company with outsourced jobs in China and India.  http://thedc.com/LdJWSw "}
{"id": 217690546490195968, "date": "2012-06-27", "time": "02:47:25", "tweet": "Scary--now China's Development Bank is looking to buy U.S. homes and developments  http://on.wsj.com/MPDLXo  They will own our country soon."}
{"id": 215869447502696448, "date": "2012-06-22", "time": "02:11:01", "tweet": "Now China won't allow an American to leave the country over a debt dispute--and @BarackObama won't comment.  http://bit.ly/NUP17D "}
{"id": 214819541434384384, "date": "2012-06-19", "time": "04:39:04", "tweet": "On Friday @VPBiden said that China has better cities and airports than the US. Well what has @BarackObama done about it the last 3 years?!"}
{"id": 214775676472000512, "date": "2012-06-19", "time": "01:44:46", "tweet": "My @foxandfriends interview discussing @BarackObama's immigration policy, @VPBiden's China comments and 2012 election  http://bit.ly/NK3MJo "}
{"id": 213708392554954752, "date": "2012-06-16", "time": "03:03:45", "tweet": "The U.S. needs to protect our intelligence assets, especially in China. If the Chinese want to spy on us, then we need to return the favor."}
{"id": 212990869211578368, "date": "2012-06-14", "time": "03:32:35", "tweet": "China's currency manipulation is one of our nation's greatest sovereign threats. The yuan has appreciated 40% against our dollar since 2005."}
{"id": 212978018539417600, "date": "2012-06-14", "time": "02:41:31", "tweet": "Thanks to @BarackObama rejecting the Keystone XL pipeline, China has become Canada's biggest oil consumer. China is laughing at us!"}
{"id": 212629431397781504, "date": "2012-06-13", "time": "03:36:21", "tweet": "Sad.@BarackObama has already exempted major oil importers on Iranian sanctions and is negotiating a waiver with China. http://nyti.ms/KAOnVq"}
{"id": 212266828062400512, "date": "2012-06-12", "time": "03:35:30", "tweet": "China has copied our military's F-22 Raptor design  http://bit.ly/JOGwbL  We should offset their theft from our debt."}
{"id": 211193063622709248, "date": "2012-06-09", "time": "04:28:44", "tweet": "Scary--the CBO esimated that US publicly held debt amounts to over 70%. China is buying our country up."}
{"id": 210411297706217473, "date": "2012-06-07", "time": "00:42:17", "tweet": "China's new AND ADVANCED currency manipulation is killing the U.S. Help!"}
{"id": 210101183690457088, "date": "2012-06-06", "time": "04:10:00", "tweet": "China's best friend @BarackObama wants to cut the US fleet down to 230 ships, the lowest level since WWI. http://bit.ly/Mvg74D"}
{"id": 209734672320704512, "date": "2012-06-05", "time": "03:53:37", "tweet": "Now that China's own economy is slowing  http://buswk.co/JGJvOx  watch how they start doing even bigger numbers in (cont)  http://tl.gd/hmps9s "}
{"id": 208590264720310272, "date": "2012-06-02", "time": "00:06:09", "tweet": "Bay Bridge in California made in China for $1.8 billion. $300 million in cost overruns. Are we stupid?"}
{"id": 208205405606785025, "date": "2012-05-31", "time": "22:36:51", "tweet": "China and Saudi Arabia recently struck a deal which is \"the largest expansion by any oil company in the world\" (cont)  http://tl.gd/hku5qt "}
{"id": 207902918739902467, "date": "2012-05-31", "time": "02:34:53", "tweet": "Now Chinese agents are smuggling our military weapons through rogue US soldiers  http://reut.rs/JqtjFT  China loves to cheat!"}
{"id": 207558845193654272, "date": "2012-05-30", "time": "03:47:39", "tweet": "China is now criticizing the US human rights record  http://bit.ly/Ly8B2m   They have zero credibility on the issue. Can you believe this?"}
{"id": 205020507781865472, "date": "2012-05-23", "time": "03:41:12", "tweet": "China is now given preference to buy US debt by going directly to Treasury. I don't believe @BarackObama knows that he selling us out."}
{"id": 204662391449980928, "date": "2012-05-22", "time": "03:58:11", "tweet": "By releasing Chen, China showed that its political situation is becoming increasingly unstable to domestic (cont)  http://tl.gd/hgp08j "}
{"id": 202128951387242496, "date": "2012-05-15", "time": "04:11:12", "tweet": "Now China is threatening our allies who share defense pacts with us, the latest is the Philippines   http://bit.ly/KFW4wy   Very aggressive"}
{"id": 202120412698648576, "date": "2012-05-15", "time": "03:37:16", "tweet": "China, Japan and South Korea agreed to have free trade negotiations--notice they don't ask the U.S. to join in (cont)  http://tl.gd/hdno1t "}
{"id": 202100733213020161, "date": "2012-05-15", "time": "02:19:04", "tweet": "Very resource rich Canada, our neighbor, is looking to China for its growth. Just another sad commentary on the U.S.  http://on.wsj.com/KkQVfb "}
{"id": 200605771568914432, "date": "2012-05-10", "time": "23:18:37", "tweet": "Welcome to the new reality. @BarackObama is now letting China buy US banks  http://yhoo.it/IYYMjB  The US government is selling us out."}
{"id": 200299016821538819, "date": "2012-05-10", "time": "02:59:41", "tweet": "My @gretawire interview discussing the economy, unemployment numbers, China, Charles Barkley,France and the election   http://bit.ly/LNV6Rg "}
{"id": 199590671529676802, "date": "2012-05-08", "time": "04:04:58", "tweet": "We must keep the pressure on @BarackObama's administration to make sure Chen comes to the US. It would be a tragedy to abandon him in China."}
{"id": 198116073126641664, "date": "2012-05-04", "time": "02:25:27", "tweet": "Now @BarackObama is praising China's \"cooperation\" in negotiations over Chen Guangcheng  http://bit.ly/KsSfqY  This is a sad episode for us."}
{"id": 197771334934216704, "date": "2012-05-03", "time": "03:35:35", "tweet": "WRONG!@BarackObama capitulated to China by releasing Chen Guangcheng out of the US Embassy  http://wapo.st/IGTpCi  China really has our number"}
{"id": 197754030318034944, "date": "2012-05-03", "time": "02:26:49", "tweet": "Orders for U.S. factory goods in March record biggest decline in 3 years  http://bit.ly/IEtuye  China is eroding the US manufacturing sector."}
{"id": 197697954184830976, "date": "2012-05-02", "time": "22:43:59", "tweet": "\"China's leadership is sneaky and underhanded, they significantly underreport their actual defense budget and (cont)  http://tl.gd/h8fbkb "}
{"id": 195207050261823493, "date": "2012-04-26", "time": "01:46:02", "tweet": "\"Right now, we are running a massive $300 billion trade deficit with China. That means every year.  China is (cont)  http://tl.gd/h55j1d "}
{"id": 194859987573538816, "date": "2012-04-25", "time": "02:46:56", "tweet": "Demand by China continues to raise the price of oil  http://bloom.bg/I6v1cq  We must become energy independent through our vast resources."}
{"id": 194515393119911936, "date": "2012-04-24", "time": "03:57:38", "tweet": "@JonHuntsman just trashed the GOP and stood up for China on Sunday  http://bit.ly/Jz8iqj   I am surprised he didn't say it in Mandarin."}
{"id": 192683608727760896, "date": "2012-04-19", "time": "02:38:46", "tweet": "Bad! Total foreign holdings of US debt continue to increase with China increasing its holding a 2nd straight month  http://cbsn.ws/J4EhAv "}
{"id": 192319079300870145, "date": "2012-04-18", "time": "02:30:16", "tweet": "Our ally Canada is 'frustrated' by @BarackObama's radical anti-gas policies  http://bit.ly/IRTyT6  BHO is forcing Canada to send gas to China."}
{"id": 192294299679989760, "date": "2012-04-18", "time": "00:51:48", "tweet": "While @BarackObama watches, China is trying to have the yuan overtake our dollar as the international (cont)  http://tl.gd/h12vfv "}
{"id": 190848909659226112, "date": "2012-04-14", "time": "01:08:20", "tweet": "Now @BarackObama's Vice-Chief of Joint Staff is defending China while they cheat  http://bit.ly/IyzpnV   Wrong course of action."}
{"id": 190157750767071232, "date": "2012-04-12", "time": "03:21:55", "tweet": "China attempted to sell embargoed computers to Iran  http://reut.rs/IgKAgo  China loves these deals!"}
{"id": 190066305137786881, "date": "2012-04-11", "time": "21:18:33", "tweet": "Thousands of US warplanes, ships and missiles contain fake electronic components from China, leaving them open (cont)  http://tl.gd/gtqm32 "}
{"id": 188301406413930496, "date": "2012-04-07", "time": "00:25:28", "tweet": "It's @BarackObama--who wants to raise all our taxes--who applauds China for cutting their taxes! (cont)  http://tl.gd/grbgn8 "}
{"id": 188299853749690370, "date": "2012-04-07", "time": "00:19:18", "tweet": "His @BarackObama's budget: interest payments to China will exceed US defense spending by 2019  http://bit.ly/HrYaeQ  @BarackObama's America!"}
{"id": 187914114511810560, "date": "2012-04-05", "time": "22:46:30", "tweet": "\"Here's the solution on China: get tough. Slap a 25 percent tax on China's products if they don't set a real (cont)  http://tl.gd/gqo0qo "}
{"id": 187255259607994368, "date": "2012-04-04", "time": "03:08:27", "tweet": "\"China is our enemy. It's time we start acting like it and if we do our job correctly, China will gain a whole (cont)  http://tl.gd/gpp76f "}
{"id": 185786587538403328, "date": "2012-03-31", "time": "01:52:28", "tweet": "@MittRomney studying ways to increase pressure on China over their currency manipulation and unfair subsidy practices  http://reut.rs/Hxd4ne "}
{"id": 185100560821784576, "date": "2012-03-29", "time": "04:26:27", "tweet": "I wonder if @BarackObama has promised Iran and China that he can be more flexible after his last election?"}
{"id": 185014028706394112, "date": "2012-03-28", "time": "22:42:36", "tweet": "\"America's relationship with China is at a crossroads. We only have a short window of time to make the tough (cont)  http://tl.gd/gm9oid "}
{"id": 183263631042027520, "date": "2012-03-24", "time": "02:47:09", "tweet": "\"With China beating us like a punching bag daily, OPEC vacuuming our wallets clean, and jobs nowhere in sight, (cont)  http://tl.gd/gjbglv "}
{"id": 182541178904903681, "date": "2012-03-22", "time": "02:56:23", "tweet": "\"We have to get tough on China. For every one American child there are four Chinese. China is out to steal our (cont)  http://tl.gd/gi2v23 "}
{"id": 179267639363895296, "date": "2012-03-13", "time": "02:08:30", "tweet": "China talks about the so-called \"carbon footprint\" and then, behind our leaders backs, they laugh. They could (cont)  http://tl.gd/gd1gc2 "}
{"id": 177856011917467648, "date": "2012-03-09", "time": "04:39:12", "tweet": "\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take (cont)  http://tl.gd/garokg "}
{"id": 177129464529043456, "date": "2012-03-07", "time": "04:32:09", "tweet": "\"The military threat from China is gigantic--and it's no surprise that the Communist Chinese government lies (cont)  http://tl.gd/g9nlln "}
{"id": 177126743491084288, "date": "2012-03-07", "time": "04:21:21", "tweet": "\"While China screws us with every turn of its currency, is the biggest commercial espionage threat we face, (cont)  http://tl.gd/g9niv4 "}
{"id": 177100813464895488, "date": "2012-03-07", "time": "02:38:18", "tweet": "China is raising its defense budget by 11%  http://bit.ly/zO1KvF  @BarackObama wants to cut ours by over $1Trillion. Wrong policy."}
{"id": 174945557935173632, "date": "2012-03-01", "time": "03:54:06", "tweet": "China is getting minerals from Afghanistan  http://usat.ly/t69pc1  We are getting our troops killed by the Afghani govt't.  Time to get out."}
{"id": 174591043675758593, "date": "2012-02-29", "time": "04:25:23", "tweet": "\"@BarackObama seems to have no regard for how China is conducting massive industrial espionage against the (cont)  http://tl.gd/g5tfb8 "}
{"id": 173146855046258688, "date": "2012-02-25", "time": "04:46:41", "tweet": "\"For a country like China, being able to steal our military designs represents hundreds of billions in savings (cont)  http://tl.gd/g3nd51 "}
{"id": 172778797010124800, "date": "2012-02-24", "time": "04:24:09", "tweet": "\"If China didn't play games with its currency and we played on a level economic playing field, we could easily (cont)  http://tl.gd/g34s1g "}
{"id": 172425301853351937, "date": "2012-02-23", "time": "04:59:30", "tweet": "\"America's relationship with China is at a crossroads. We only have a short window of time to make the tough (cont)  http://tl.gd/g2ida8 "}
{"id": 172066467926380545, "date": "2012-02-22", "time": "05:13:37", "tweet": "\"Right now we have a president and a Treasury secretary who shrug while China tears away hundreds of thousands (cont)  http://tl.gd/g1vo61 "}
{"id": 171994909711142913, "date": "2012-02-22", "time": "00:29:16", "tweet": "My interview from this morning with Ron Jolly on News Talk 580 on behalf of @MittRomney how he is right on China  http://bit.ly/AA8Xqu "}
{"id": 170610082260852737, "date": "2012-02-18", "time": "04:46:28", "tweet": "Our ally Canada wants to send their oil down south to us. @BarackObama is forcing Canada to send it west to China."}
{"id": 170609601790754816, "date": "2012-02-18", "time": "04:44:33", "tweet": "He @MittRomney wrote a great piece on China  http://on.wsj.com/Ae301M  @JonHuntsman criticized him  (cont)  http://tl.gd/fvlqtm "}
{"id": 170244434087247872, "date": "2012-02-17", "time": "04:33:30", "tweet": "Yesterday China VP Xi stressed \"the benefits of trade with China\" to Congress  http://on.wsj.com/xSfN83   We need FAIR TRADE with China!"}
{"id": 170176754579808256, "date": "2012-02-17", "time": "00:04:34", "tweet": "He @MittRomney gets the China problem, why don't the others?"}
{"id": 169900579076849665, "date": "2012-02-16", "time": "05:47:09", "tweet": "Canada's PM was in China last week brokering a deal to sell the oil @BarackObama rejected in Keystone.  http://bit.ly/xUAFde    Unbelievable!"}
{"id": 169897369700278272, "date": "2012-02-16", "time": "05:34:24", "tweet": "Wrong Policy: @BarackObama wants to cut defense spending by $487B while China is building their navy in the Pacific.  http://reut.rs/zttD4f "}
{"id": 169869653571682306, "date": "2012-02-16", "time": "03:44:16", "tweet": "\"China is our enemy. It's time we start acting like it...and if we do our job corectly, China will gain a whole (cont)  http://tl.gd/fuf20b "}
{"id": 169861061560909824, "date": "2012-02-16", "time": "03:10:07", "tweet": "\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\" (cont)  http://tl.gd/fuenkn "}
{"id": 169853834083053568, "date": "2012-02-16", "time": "02:41:24", "tweet": "Next to Chinese VP Xi Jinping yesterday, @BarackObama said he welcomes China's \"peaceful rise.\" (cont)  http://tl.gd/fuedbd "}
{"id": 169511618261159936, "date": "2012-02-15", "time": "04:01:33", "tweet": "\"We need a president who is smart and tough enough to recognize the national security threat China poses in the (cont)  http://tl.gd/ftso2p "}
{"id": 169487192719233024, "date": "2012-02-15", "time": "02:24:30", "tweet": "So wrong! @BarackObama is hosting China's VP Xi Jinping today at the Pentagon with a full honor ceremony with music and cannons..."}
{"id": 169486400364888064, "date": "2012-02-15", "time": "02:21:21", "tweet": "A day after @BarackObama released a trillion dollar budget deficit, he is hosting China's future leader VP XiJinping. America's new reality."}
{"id": 169160076383367168, "date": "2012-02-14", "time": "04:44:39", "tweet": "\"Look, when it comes to China, America better stop messing around. China sees us as a naive, gullible, foolish (cont)  http://tl.gd/ft8q68 "}
{"id": 169150613261791232, "date": "2012-02-14", "time": "04:07:03", "tweet": "He capitulated to China--@BarackObama abandoned a senior level Chinese officer who wanted to defect to the US: WRONG! http://bit.ly/wfszrf "}
{"id": 169137479004340224, "date": "2012-02-14", "time": "03:14:52", "tweet": "Congratulations to @MittRomney for CPAC and Maine straw poll wins. He will get tough with China and save America."}
{"id": 168064739690295296, "date": "2012-02-11", "time": "04:12:11", "tweet": "@MittRomney will give a great speech at CPAC today. He understands the threat from China."}
{"id": 167405659057426433, "date": "2012-02-09", "time": "08:33:14", "tweet": "Jon Huntsman called to see me. I said no, he gave away our country to China! @JonHuntsman"}
{"id": 167347755499536385, "date": "2012-02-09", "time": "04:43:08", "tweet": "\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take (cont)  http://tl.gd/fq6cfr "}
{"id": 167313163954569216, "date": "2012-02-09", "time": "02:25:41", "tweet": "Why is @MittRomney the only guy who talks about getting tough with China and their currency manipulation?"}
{"id": 167311471867465729, "date": "2012-02-09", "time": "02:18:58", "tweet": "China did a major number on us during the reign of @JonHuntsman. He was easy pickens!"}
{"id": 166980337212211201, "date": "2012-02-08", "time": "04:23:09", "tweet": "I endorsed @MittRomney not because I agree with him on every issue but because he will get tough with China."}
{"id": 166641357291667457, "date": "2012-02-07", "time": "05:56:10", "tweet": "As China is building an air and naval force, @BarackObama is cutting ours.  http://bit.ly/zyzUSp    He is weakening our national security."}
{"id": 166577929944436736, "date": "2012-02-07", "time": "01:44:08", "tweet": "\"So, I speak badly of China, but I speak the truth and what do the consumers in China want? They want Trump.\" (cont)  http://tl.gd/foujvq "}
{"id": 164012329116246017, "date": "2012-01-30", "time": "23:49:21", "tweet": "\"The military threat from China is gigantic and it's no surprise that the Communist Chinese government lies (cont)  http://tl.gd/fknea2 "}
{"id": 162587605458878464, "date": "2012-01-27", "time": "01:28:00", "tweet": "My @gretawire interview discussing @IvankaTrump wanting me to run for POTUS, @BarackObama’s SOTU and his China policy  http://bit.ly/z1efQf "}
{"id": 161880088898584578, "date": "2012-01-25", "time": "02:36:35", "tweet": "\"It starts with China and OPEC. The hundreds of billions of dollars they steal from us each year must end right (cont)  http://tl.gd/fh6mek "}
{"id": 161491946173505536, "date": "2012-01-24", "time": "00:54:15", "tweet": "\"I have great respect for the people that represent China. What I don't respect is the way that we negotiate and (cont)  http://tl.gd/fghhlr "}
{"id": 160451510608736256, "date": "2012-01-21", "time": "03:59:55", "tweet": "China has hacked another US government body.  http://bit.ly/yBGHBP  When will we learn?"}
{"id": 160444554452013057, "date": "2012-01-21", "time": "03:32:17", "tweet": "Canada will now sell its oil to China because @BarackObama rejected Keystone. At least China knows a good deal when they see it."}
{"id": 159772392590295040, "date": "2012-01-19", "time": "07:01:21", "tweet": "“China presents three big threats to the United States in its outrageous currency manipulation, its systematic (cont)  http://tl.gd/fdjjc3 "}
{"id": 159416243881914368, "date": "2012-01-18", "time": "07:26:09", "tweet": "@BarackObama won’t approve the Keystone Pipeline so Canada is now looking to sell their oil to China (cont)  http://tl.gd/fd0h00 "}
{"id": 159297839292354560, "date": "2012-01-17", "time": "23:35:39", "tweet": "My interview with @IngrahamAngle discussing the GOP primary, China ripping us off and the state of the economy   http://bit.ly/berpv9 "}
{"id": 157566407180165120, "date": "2012-01-13", "time": "04:55:33", "tweet": "The US is always getting ripped off! China gets cheap oil from Iran and Iraq as US pays for Hormuz Patrols to (cont)  http://tl.gd/f9uvoa "}
{"id": 155371968630239232, "date": "2012-01-07", "time": "03:35:38", "tweet": "\"Getting China to stop playing its currency charades can begin whenever we elect a president ready to take decisive action.\" #TimeToGetTough"}
{"id": 155000792967946240, "date": "2012-01-06", "time": "03:00:43", "tweet": "China is driving the price of gold up in order to ease pressure against Iranian sanctions.  http://bit.ly/zTIER0 "}
{"id": 154622532346056705, "date": "2012-01-05", "time": "01:57:39", "tweet": "\"Under President @BarackObama, China has experienced unusually fast gains and America unusually fast losses.\" #TimeToGetTough"}
{"id": 152823189410545665, "date": "2011-12-31", "time": "02:47:42", "tweet": "When will the US government finally classify China as a currency manipulator? China is robbing us blind and @BarackObama defends them."}
{"id": 152097238271787008, "date": "2011-12-29", "time": "02:43:02", "tweet": "China has 5 oil projects in Iraq and we didn't get anything from the Iraqis except asked to leave. Iraq is going (cont)  http://tl.gd/f0ec7f "}
{"id": 151776172232015872, "date": "2011-12-28", "time": "05:27:13", "tweet": "China is expanding its military bases abroad. We must expand our naval fleet. Now is no time for defense cuts. (cont)  http://tl.gd/evprp9 "}
{"id": 151770881134297088, "date": "2011-12-28", "time": "05:06:12", "tweet": "China hacked the U.S. Chamber of Commerce and now has the information of all 3 million members. China keeps (cont)  http://tl.gd/evpm0i "}
{"id": 149143097090113537, "date": "2011-12-20", "time": "23:04:19", "tweet": "China taxing imports from the US --22%-- why aren't we taxing China?"}
{"id": 148875185683038208, "date": "2011-12-20", "time": "05:19:44", "tweet": "Our diplomats are weak: @JonHuntsman's China policy proves why we need businesmen to negotiate against China."}
{"id": 148873594292809728, "date": "2011-12-20", "time": "05:13:25", "tweet": "Railing at Obama over China: @maggiepolitico  http://politi.co/vqdtgd "}
{"id": 148872560120045568, "date": "2011-12-20", "time": "05:09:18", "tweet": "RT @TheDCVInce: Trump's letter to Obama: China thinks you're weak  http://thedc.com/sETUHe "}
{"id": 148871667345666048, "date": "2011-12-20", "time": "05:05:46", "tweet": "My @FoxNews interview on @FNTTHe Five discussing the #TimeToGetTough, the GOP primary and China's tariff on our cars  http://bit.ly/ue19nv "}
{"id": 147783012300492800, "date": "2011-12-17", "time": "04:59:50", "tweet": "China, OPEC, Russia and Iran no longer respect us--@BarackObama's foreign policies have proved that weakness is provocative."}
{"id": 147777192439459840, "date": "2011-12-17", "time": "04:36:42", "tweet": "China just put a tariff on US cars and trucks--22%--China is laughing at our inept leaders. @BarackObama"}
{"id": 147769627647287296, "date": "2011-12-17", "time": "04:06:39", "tweet": "A total lightweight: @JonHuntsman continues to give the worst responses on China in the debates. I can see why (cont)  http://tl.gd/eot026 "}
{"id": 147370843876499456, "date": "2011-12-16", "time": "01:42:01", "tweet": "#trumpvlog China is laughing....  http://youtu.be/Iyae36yHp54 "}
{"id": 147059490020274178, "date": "2011-12-15", "time": "05:04:49", "tweet": "The Mullahs laughed when @BarackObama \"asked\" Iran to return our drone--they will show it to China first."}
{"id": 146332661848358912, "date": "2011-12-13", "time": "04:56:39", "tweet": "China and OPEC were not mentioned in a single question in the @ABC Iowa debate this past Saturday. Wait for the Newsmax-@iontv debate!"}
{"id": 145170904417185793, "date": "2011-12-10", "time": "00:00:15", "tweet": "#TimeToGetTough presents bold solutions on taxes, national security, the debt, dealing with OPEC and China and defeating @BarackObama."}
{"id": 143733192204103680, "date": "2011-12-06", "time": "00:47:18", "tweet": "#TimeToGetTough: Making America #1 Again--my new book--available today.   The book both China and OPEC do NOT want you to read."}
{"id": 142716804173791233, "date": "2011-12-03", "time": "05:28:32", "tweet": "When it comes to China, @BarackObama practices \"pretty please\" diplomacy. He begs and pleads and bows---and it… (cont)  http://deck.ly/~sgjvu "}
{"id": 142683518550544385, "date": "2011-12-03", "time": "03:16:16", "tweet": "We are building China's wealth by buying all their products, even though we make better products in America."}
{"id": 142241296902389760, "date": "2011-12-01", "time": "21:59:02", "tweet": "When it comes to China, @BarackObama practices \"pretty please\" diplomacy. He begs and pleads and bows--and it'… (cont)  http://deck.ly/~Q9lAG "}
{"id": 141961003352076288, "date": "2011-12-01", "time": "03:25:15", "tweet": "China is so brazen that they now give us economic advice--they tell us  what to do---much like a strong stockh… (cont)  http://deck.ly/~ltB8C "}
{"id": 141623403621777410, "date": "2011-11-30", "time": "05:03:45", "tweet": "America's trade deficit with China is one of our greatest national security threats.  Time for Fair Trade. We must produce our own products."}
{"id": 141237893267075073, "date": "2011-11-29", "time": "03:31:52", "tweet": "Washington will continue to run record deficits into the election. We are borrowing at a rate of $1.40 from China. Truly unsustainable."}
{"id": 139378215000096768, "date": "2011-11-24", "time": "00:22:10", "tweet": "American sanctions alone cannot stop Iran's nuclear drive--and @BarackObama cannot get China and Russia to agree on new Iranian sanctions."}
{"id": 139089731710488576, "date": "2011-11-23", "time": "05:15:50", "tweet": "Why are we giving China foreign aid? Couldn't the Super Committee have agreed to at least cut that outlay? #TimeToGetTough"}
{"id": 139057689958416384, "date": "2011-11-23", "time": "03:08:31", "tweet": "As of September 30th, we have a record trade deficit with China of over $217Billion. They are ripping us off.  #TimeToGetTough"}
{"id": 138641877158207488, "date": "2011-11-21", "time": "23:36:14", "tweet": "China's economy is now projected to overtake the US as the world's largest economy by 2027  http://tgr.ph/uSvGQ4  #TimeToGetTough"}
{"id": 137629814998835200, "date": "2011-11-19", "time": "04:34:39", "tweet": "Why is @BarackObama delaying the sale of F-16 aircraft to Taiwan? Wrong message to send to China. #TimeToGetTough"}
{"id": 137271646301065216, "date": "2011-11-18", "time": "04:51:25", "tweet": "China is complaining about 2,500 marines being placed in Australia.  Meanwhile they are building bases across Latin America. #TimeToGetTough"}
{"id": 136200595748028417, "date": "2011-11-15", "time": "05:55:27", "tweet": "@BarackObama delayed the Keystone pipeline decision until 2013. Now Canada is looking to export more oil to China.  http://bit.ly/uCGpeC "}
{"id": 134639700139974656, "date": "2011-11-10", "time": "22:33:00", "tweet": "China is advocating on behalf of Iran's nuclear program -- the Chinese oppose both sanctions and any militar… (cont)  http://deck.ly/~BlGDb "}
{"id": 132507368171900928, "date": "2011-11-05", "time": "01:19:53", "tweet": "China 'scorns'  US cyber espionage charges--China does not respect us   http://reut.rs/vloYTi   and feels Obama is a \"dummy\""}
{"id": 131719511882739712, "date": "2011-11-02", "time": "21:09:13", "tweet": "Another company that the DOE has given money to just filed for bankruptcy. This is how the money we borrow at 40% from China is wasted."}
{"id": 129283360571916288, "date": "2011-10-27", "time": "03:48:49", "tweet": "When will Washington stand up to China. China is manipulating its currency and stealing our jobs. Washington should move on legislation."}
{"id": 128908232956723201, "date": "2011-10-26", "time": "02:58:12", "tweet": "Why does the federal government send foreign aid  to China? Unbelievable! Washington is financing America's de… (cont)  http://deck.ly/~2h6F4 "}
{"id": 127462951014776832, "date": "2011-10-22", "time": "03:15:10", "tweet": "Why do we continue to sit idly by while China steals our national security and corporate secrets? China is an enemy, not a friend."}
{"id": 126703082137591808, "date": "2011-10-20", "time": "00:55:43", "tweet": "Both @BarackObama and China have embraced OWS. All want the decline of America. Time for the protesters to go home."}
{"id": 126359904750551041, "date": "2011-10-19", "time": "02:12:03", "tweet": "Now China is publicly supporting the OWS protests   http://apne.ws/opKzMd .  It's time for the protesters to go home."}
{"id": 126300698945134593, "date": "2011-10-18", "time": "22:16:47", "tweet": "@BarackObama is holding Taiwan's request for 66 advanced F-16's. Wrong message to send to China."}
{"id": 126025586509488128, "date": "2011-10-18", "time": "04:03:35", "tweet": "@Johnboehner: Stop \"The China Curse\" --- Pass the China Currency Bill!"}
{"id": 125923291591475200, "date": "2011-10-17", "time": "21:17:06", "tweet": "China's military buildup is a major threat to the Free World. We must remain resolute and maintain our national defense at all costs."}
{"id": 124864927092580352, "date": "2011-10-14", "time": "23:11:33", "tweet": "Stop \"The China Curse\" -- Pass the Chinese Currency Bill!"}
{"id": 124849111122980864, "date": "2011-10-14", "time": "22:08:42", "tweet": "My @FoxNews interview on @gretawire discussing \"The China Curse\"  http://bit.ly/pCC3Bd "}
{"id": 121945154365046784, "date": "2011-10-06", "time": "21:49:25", "tweet": "China is threatening Washington over the currency bill.  We should pass it immediately."}
{"id": 119484163010215936, "date": "2011-09-30", "time": "02:50:19", "tweet": "China does not negotiate from a position of strength, we simply negotiate against ourselves. We have all the advantages but don't execute."}
{"id": 119116243537113088, "date": "2011-09-29", "time": "02:28:20", "tweet": "China is stealing our jobs. We need to demand China stop manipulating its currency and end its rampant corporate espionage."}
{"id": 117256241444683777, "date": "2011-09-23", "time": "23:17:21", "tweet": "Our deficit spending is China’s gain. @BarackObama is bankrupting our country."}
{"id": 116575636583227392, "date": "2011-09-22", "time": "02:12:52", "tweet": "China is neither an ally or a friend--they want to beat us and own our country."}
{"id": 116527761002201089, "date": "2011-09-21", "time": "23:02:37", "tweet": "Our next President must stop China's Rip-off of America."}
{"id": 114811039996063744, "date": "2011-09-17", "time": "05:20:59", "tweet": "If China had a tenth of the natural resources we do then they would already be energy independent. Instead we continue to buy oil from OPEC."}
{"id": 114001100046221312, "date": "2011-09-14", "time": "23:42:34", "tweet": "My interview yesterday with @TeamCavuto where I discuss Dick Cheney and China  http://bit.ly/pzfJd7 "}
{"id": 111852221376888832, "date": "2011-09-09", "time": "01:23:42", "tweet": "China is happy to learn that @BarackObama plans to borrow another $300 Billion. @BarackObama is their favorite client."}
{"id": 108628640744484864, "date": "2011-08-31", "time": "03:54:20", "tweet": "China's business interests reach far and wide---even domestically within our borders. We need to reassess our relationship."}
{"id": 106776880354557953, "date": "2011-08-26", "time": "01:16:06", "tweet": "China's corporate espionage is a continued threat to the American economy. With the right leadership, it can be stopped."}
{"id": 106375487756046336, "date": "2011-08-24", "time": "22:41:07", "tweet": "Just as I predicted, @Joe_Biden was a complete disaster in China. He condoned the Chinese one-child policy an… (cont)  http://deck.ly/~sjayl "}
{"id": 104641580895453184, "date": "2011-08-20", "time": "03:51:11", "tweet": "@BarackObama is sure a master delegator. He has sent @Joe_Biden to China. The Chinese are laughing at us. We MUST do better."}
{"id": 104624327122616322, "date": "2011-08-20", "time": "02:42:38", "tweet": "@BarackObama’s new job plan will certainly do the following – 1. Not create any jobs. 2. Borrow more money from China. "}
{"id": 103497844723429376, "date": "2011-08-17", "time": "00:06:23", "tweet": "China owes us money....  http://bit.ly/mWTiBH  #trumpvlog"}
{"id": 103192686349131776, "date": "2011-08-16", "time": "03:53:48", "tweet": "China is a threat to America. They are not our friend."}
{"id": 102429248396075009, "date": "2011-08-14", "time": "01:20:10", "tweet": "Mike Huckebee, a great guy, said the President should appoint me Treasury Secretary. China and OPEC would not be happy."}
{"id": 99210286686408704, "date": "2011-08-05", "time": "04:09:10", "tweet": "China demanded that we raise our debt ceiling and then their rating agency downgraded us. Our leaders are hope… (cont)  http://deck.ly/~x0TDx"}
{"id": 98764168760532992, "date": "2011-08-03", "time": "22:36:27", "tweet": "Wake Up America -- China is eating our lunch."}
{"id": 96640218513412096, "date": "2011-07-29", "time": "01:56:38", "tweet": "@KarlRove's @CrossroadsGPS new ad criticizes Obama for his excessive spending and debt, borrowing from China. Didn't Bush do the same thing?"}
{"id": 96213917306597377, "date": "2011-07-27", "time": "21:42:40", "tweet": "China has so much of our debt that they can't put us in default w/o killing themselves---US needs our toughest negotiator---and fast!"}
{"id": 93774719052029953, "date": "2011-07-21", "time": "04:10:09", "tweet": "\"China is our enemy--they want to destroy us\" -- Redstate Interview"}
{"id": 93306458074132481, "date": "2011-07-19", "time": "21:09:27", "tweet": "So China is ordering us to raise the Debt Limit...How low have we as a nation sunk?"}
{"id": 93030160189763584, "date": "2011-07-19", "time": "02:51:33", "tweet": "Every dollar @BarackObama spends costs $1.40 with interest borrowed from China on our children and grandchildren's backs. CUT-CAP-BALANCE!"}
{"id": 30735120168128512, "date": "2011-01-28", "time": "05:13:18", "tweet": "THe people at shouldtrumprun.com have got it right! How are our factories supposed to compete with China and other countries..."}
